[Killed] BlockStatement
src/adapters/config-loader.ts:47:67
 
 export type ConfigEntry = ElfEntry | SObjectEntry | CsvEntry
 
-export function isElfEntry(entry: ConfigEntry): entry is ElfEntry {
-  return 'eventLog' in entry
-}
+export function isElfEntry(entry: ConfigEntry): entry is ElfEntry {}
 
 export function isSObjectEntry(entry: ConfigEntry): entry is SObjectEntry {
killedBy: DatasetLoad NUT dry-run given valid config with entries, when running with dry-run flag, then returns zero counts without executing
statusReason: Unknown entry shape

[Killed] BlockStatement
src/adapters/config-loader.ts:51:75
   return 'eventLog' in entry
 }
 
-export function isSObjectEntry(entry: ConfigEntry): entry is SObjectEntry {
-  return 'sObject' in entry
-}
+export function isSObjectEntry(entry: ConfigEntry): entry is SObjectEntry {}
 
 export function isCsvEntry(entry: ConfigEntry): entry is CsvEntry {
killedBy: DatasetLoad NUT e2e pipeline - SObject given valid SObject config with two records, when running full pipeline, then processes one entry and persists latest watermark
statusReason: Unknown entry shape

[Timeout] BlockStatement
src/adapters/config-loader.ts:55:67
   return 'sObject' in entry
 }
 
-export function isCsvEntry(entry: ConfigEntry): entry is CsvEntry {
-  return 'csvFile' in entry
-}
+export function isCsvEntry(entry: ConfigEntry): entry is CsvEntry {}
 
 interface Config {

[Killed] StringLiteral
src/adapters/config-loader.ts:56:10
 }
 
 export function isCsvEntry(entry: ConfigEntry): entry is CsvEntry {
-  return 'csvFile' in entry
+  return "" in entry
 }
 
killedBy: DatasetLoad NUT e2e pipeline - reader fan-out given two file-target entries sharing same CSV reader, when pipeline runs, then both output files receive data and file is read only once
statusReason: Config loading failed: No username found.

[Killed] Regex
src/adapters/config-loader.ts:69:24
   augmentColumns: Record<string, string>
 }
 
-const MUSTACHE_TOKEN = /\{\{([\w.]+)\}\}/g
+const MUSTACHE_TOKEN = /\{\{([^\w.]+)\}\}/g
 const MUSTACHE_TARGETORG = /\{\{targetOrg\./
 const MUSTACHE_SOURCEORG = /\{\{sourceOrg\./
killedBy: ConfigLoader augment column resolution given {{sourceOrg.Id}} mustache token, when loading, then resolves to source org id
statusReason: expected { OrgId: '{{sourceOrg.Id}}' } to deeply equal { OrgId: '00Dsrc' }

[Killed] Regex
src/adapters/config-loader.ts:85:5
 const datasetColumnName = z
   .string()
   .regex(
-    /^[a-zA-Z_][a-zA-Z0-9_.]*$/,
+    /^[a-zA-Z_][^a-zA-Z0-9_.]*$/,
     'Must be a valid dataset column name (letters, digits, underscores, dots)'
   )
killedBy: ConfigLoader given file-target entry with plain augmentColumns, when parsing, then accepts without mustache error
statusReason: [
  {
    "code": "invalid_union",
    "errors": [
      [
        {
          "code": "invalid_key",
          "origin": "record",

[Killed] Regex
src/adapters/config-loader.ts:85:5
 const datasetColumnName = z
   .string()
   .regex(
-    /^[a-zA-Z_][a-zA-Z0-9_.]*$/,
+    /^[a-zA-Z_][a-zA-Z0-9_.]*/,
     'Must be a valid dataset column name (letters, digits, underscores, dots)'
   )
killedBy: ConfigLoader regex boundary validation given augmentColumns key ending with a special character, when parsing, then rejects with dataset column name error
statusReason: promise resolved "{ entries: [ { …(7) } ] }" instead of rejecting

[Killed] StringLiteral
src/adapters/config-loader.ts:90:31
   )
 const orgAlias = z
   .string()
-  .regex(/^[a-zA-Z0-9_.-]+$/, 'Must be a valid org alias (no colons)')
+  .regex(/^[a-zA-Z0-9_.-]+$/, "")
 
 const entryName = z
killedBy: ConfigLoader schema validation given invalid orgAlias with colons, when parsing, then rejects
statusReason: expected [Function] to throw error including 'Must be a valid org alias' but got '[\n  {\n    "origin": "string",\n    …'

[Killed] Regex
src/adapters/config-loader.ts:94:10
 
 const entryName = z
   .string()
-  .regex(/^[a-zA-Z0-9_-]+$/, 'Must be alphanumeric, hyphens, or underscores')
+  .regex(/^[a-zA-Z0-9_-]+/, 'Must be alphanumeric, hyphens, or underscores')
 
 function validateTargetFields(
killedBy: ConfigLoader schema validation given config with invalid name characters, when parsing, then throws validation error
statusReason: promise resolved "{ entries: [ { …(7) } ] }" instead of rejecting

[Killed] BooleanLiteral
src/adapters/config-loader.ts:100:29
   entry: { targetOrg?: string; targetDataset?: string; targetFile?: string },
   ctx: z.RefinementCtx
 ): void {
-  const hasDatasetTarget = !!entry.targetOrg
+  const hasDatasetTarget = !entry.targetOrg
   const hasFile = !!entry.targetFile
 
killedBy: DatasetLoad NUT command validation given valid config with entries, when specifying nonexistent entry name, then produces entry not found error
statusReason: expected [Function] to throw error including 'Entry \'nonexistent\' not found. Ensu…' but got 'Config loading failed: [\n  {\n    "c…'

[Killed] BooleanLiteral
src/adapters/config-loader.ts:101:19
   ctx: z.RefinementCtx
 ): void {
   const hasDatasetTarget = !!entry.targetOrg
-  const hasFile = !!entry.targetFile
+  const hasFile = !entry.targetFile
 
   if (hasDatasetTarget && hasFile) {
killedBy: DatasetLoad NUT command validation given valid config with entries, when specifying nonexistent entry name, then produces entry not found error
statusReason: expected [Function] to throw error including 'Entry \'nonexistent\' not found. Ensu…' but got 'Config loading failed: [\n  {\n    "c…'

[Killed] LogicalOperator
src/adapters/config-loader.ts:103:7
   const hasDatasetTarget = !!entry.targetOrg
   const hasFile = !!entry.targetFile
 
-  if (hasDatasetTarget && hasFile) {
+  if (hasDatasetTarget || hasFile) {
     ctx.addIssue({
       code: z.ZodIssueCode.custom,
killedBy: DatasetLoad NUT command validation given valid config with entries, when specifying nonexistent entry name, then produces entry not found error
statusReason: expected [Function] to throw error including 'Entry \'nonexistent\' not found. Ensu…' but got 'Config loading failed: [\n  {\n    "c…'

[Killed] ConditionalExpression
src/adapters/config-loader.ts:103:7
   const hasDatasetTarget = !!entry.targetOrg
   const hasFile = !!entry.targetFile
 
-  if (hasDatasetTarget && hasFile) {
+  if (false) {
     ctx.addIssue({
       code: z.ZodIssueCode.custom,
killedBy: ConfigLoader given org-target entry with both targetOrg and targetFile, when parsing, then throws validation error
statusReason: promise resolved "{ entries: [ { …(7) } ] }" instead of rejecting

[Killed] ObjectLiteral
src/adapters/config-loader.ts:104:18
   const hasFile = !!entry.targetFile
 
   if (hasDatasetTarget && hasFile) {
-    ctx.addIssue({
-      code: z.ZodIssueCode.custom,
-      message: 'Cannot specify both targetOrg and targetFile',
-    })
+    ctx.addIssue({})
   }
   if (!hasDatasetTarget && !hasFile) {
killedBy: ConfigLoader given org-target entry with both targetOrg and targetFile, when parsing, then throws validation error
statusReason: expected [Function] to throw error matching /Cannot specify both/ but got '[\n  {\n    "code": "custom",\n    "p…'

[Killed] BooleanLiteral
src/adapters/config-loader.ts:109:28
       message: 'Cannot specify both targetOrg and targetFile',
     })
   }
-  if (!hasDatasetTarget && !hasFile) {
+  if (!hasDatasetTarget && hasFile) {
     ctx.addIssue({
       code: z.ZodIssueCode.custom,
killedBy: DatasetLoad NUT file-target dry-run given file-target ELF entry, when running with dry-run flag, then shows file: prefixed dataset key
statusReason: Config loading failed: [
  {
    "code": "custom",
    "message": "Either targetOrg+targetDataset or targetFile must be specified",
    "path": [
      "entries",
      0
    ]

[Killed] ConditionalExpression
src/adapters/config-loader.ts:109:7
       message: 'Cannot specify both targetOrg and targetFile',
     })
   }
-  if (!hasDatasetTarget && !hasFile) {
+  if (false) {
     ctx.addIssue({
       code: z.ZodIssueCode.custom,
killedBy: ConfigLoader given org-target entry with neither targetOrg nor targetFile, when parsing, then throws validation error
statusReason: promise resolved "{ entries: [ { …(4) } ] }" instead of rejecting

[Killed] ObjectLiteral
src/adapters/config-loader.ts:110:18
     })
   }
   if (!hasDatasetTarget && !hasFile) {
-    ctx.addIssue({
-      code: z.ZodIssueCode.custom,
-      message: 'Either targetOrg+targetDataset or targetFile must be specified',
-    })
+    ctx.addIssue({})
   }
   if (hasDatasetTarget && !entry.targetDataset) {
killedBy: ConfigLoader given org-target entry with neither targetOrg nor targetFile, when parsing, then throws validation error
statusReason: expected [Function] to throw error including 'Either targetOrg' but got '[\n  {\n    "code": "custom",\n    "p…'

[Killed] StringLiteral
src/adapters/config-loader.ts:112:16
   if (!hasDatasetTarget && !hasFile) {
     ctx.addIssue({
       code: z.ZodIssueCode.custom,
-      message: 'Either targetOrg+targetDataset or targetFile must be specified',
+      message: "",
     })
   }
killedBy: ConfigLoader given org-target entry with neither targetOrg nor targetFile, when parsing, then throws validation error
statusReason: expected [Function] to throw error including 'Either targetOrg' but got '[\n  {\n    "code": "custom",\n    "m…'

[Killed] ConditionalExpression
src/adapters/config-loader.ts:115:7
       message: 'Either targetOrg+targetDataset or targetFile must be specified',
     })
   }
-  if (hasDatasetTarget && !entry.targetDataset) {
+  if (false) {
     ctx.addIssue({
       code: z.ZodIssueCode.custom,
killedBy: ConfigLoader given org-target entry with targetOrg but missing targetDataset, when parsing, then throws validation error
statusReason: promise resolved "{ entries: [ { …(5) } ] }" instead of rejecting

[Killed] LogicalOperator
src/adapters/config-loader.ts:115:7
       message: 'Either targetOrg+targetDataset or targetFile must be specified',
     })
   }
-  if (hasDatasetTarget && !entry.targetDataset) {
+  if (hasDatasetTarget || !entry.targetDataset) {
     ctx.addIssue({
       code: z.ZodIssueCode.custom,
killedBy: DatasetLoad NUT command validation given valid config with entries, when specifying nonexistent entry name, then produces entry not found error
statusReason: expected [Function] to throw error including 'Entry \'nonexistent\' not found. Ensu…' but got 'Config loading failed: [\n  {\n    "c…'

[Killed] ObjectLiteral
src/adapters/config-loader.ts:116:18
     })
   }
   if (hasDatasetTarget && !entry.targetDataset) {
-    ctx.addIssue({
-      code: z.ZodIssueCode.custom,
-      message: 'targetDataset is required when targetOrg is set',
-      path: ['targetDataset'],
-    })
+    ctx.addIssue({})
   }
   if (!hasDatasetTarget && entry.targetDataset) {
killedBy: ConfigLoader given org-target entry with targetOrg but missing targetDataset, when parsing, then throws validation error
statusReason: expected [Function] to throw error including 'targetDataset is required when target…' but got '[\n  {\n    "code": "custom",\n    "p…'

[Killed] StringLiteral
src/adapters/config-loader.ts:118:16
   if (hasDatasetTarget && !entry.targetDataset) {
     ctx.addIssue({
       code: z.ZodIssueCode.custom,
-      message: 'targetDataset is required when targetOrg is set',
+      message: "",
       path: ['targetDataset'],
     })
killedBy: ConfigLoader given org-target entry with targetOrg but missing targetDataset, when parsing, then throws validation error
statusReason: expected [Function] to throw error including 'targetDataset is required when target…' but got '[\n  {\n    "code": "custom",\n    "m…'

[Killed] BlockStatement
src/adapters/config-loader.ts:122:49
       path: ['targetDataset'],
     })
   }
-  if (!hasDatasetTarget && entry.targetDataset) {
-    ctx.addIssue({
-      code: z.ZodIssueCode.custom,
-      message: 'targetDataset requires targetOrg to be set',
-      path: ['targetDataset'],
-    })
-  }
+  if (!hasDatasetTarget && entry.targetDataset) {}
 }
 
killedBy: ConfigLoader given org-target entry with targetFile and targetDataset but no targetOrg, when parsing, then throws validation error
statusReason: promise resolved "{ entries: [ { …(6) } ] }" instead of rejecting

[Killed] ConditionalExpression
src/adapters/config-loader.ts:122:7
       path: ['targetDataset'],
     })
   }
-  if (!hasDatasetTarget && entry.targetDataset) {
+  if (false) {
     ctx.addIssue({
       code: z.ZodIssueCode.custom,
killedBy: ConfigLoader given org-target entry with targetFile and targetDataset but no targetOrg, when parsing, then throws validation error
statusReason: promise resolved "{ entries: [ { …(6) } ] }" instead of rejecting

[Killed] BlockStatement
src/adapters/config-loader.ts:136:9
   predicate: (value: string) => boolean,
   messageFor: (key: string) => string,
   ctx: z.RefinementCtx
-): void {
-  for (const [key, value] of Object.entries(columns)) {
-    if (predicate(String(value))) {
-      ctx.addIssue({
-        code: z.ZodIssueCode.custom,
-        message: messageFor(key),
-        path: ['augmentColumns', key],
-      })
-    }
-  }
-}
+): void {}
 
 const targetFields = {
killedBy: ConfigLoader given elf entry {{targetOrg.Id}} in augmentColumns when no targetOrg, when parsing, then error path starts with augmentColumns
statusReason: Cannot read properties of undefined (reading 'some')

[Killed] BlockStatement
src/adapters/config-loader.ts:137:55
   messageFor: (key: string) => string,
   ctx: z.RefinementCtx
 ): void {
-  for (const [key, value] of Object.entries(columns)) {
-    if (predicate(String(value))) {
-      ctx.addIssue({
-        code: z.ZodIssueCode.custom,
-        message: messageFor(key),
-        path: ['augmentColumns', key],
-      })
-    }
-  }
+  for (const [key, value] of Object.entries(columns)) {}
 }
 
killedBy: ConfigLoader given elf entry {{targetOrg.Id}} in augmentColumns when no targetOrg, when parsing, then error path starts with augmentColumns
statusReason: Cannot read properties of undefined (reading 'some')

[Killed] BlockStatement
src/adapters/config-loader.ts:138:35
   ctx: z.RefinementCtx
 ): void {
   for (const [key, value] of Object.entries(columns)) {
-    if (predicate(String(value))) {
-      ctx.addIssue({
-        code: z.ZodIssueCode.custom,
-        message: messageFor(key),
-        path: ['augmentColumns', key],
-      })
-    }
+    if (predicate(String(value))) {}
   }
 }
killedBy: ConfigLoader given elf entry {{targetOrg.Id}} in augmentColumns when no targetOrg, when parsing, then error path starts with augmentColumns
statusReason: Cannot read properties of undefined (reading 'some')

[Killed] ConditionalExpression
src/adapters/config-loader.ts:138:9
   ctx: z.RefinementCtx
 ): void {
   for (const [key, value] of Object.entries(columns)) {
-    if (predicate(String(value))) {
+    if (true) {
       ctx.addIssue({
         code: z.ZodIssueCode.custom,
killedBy: ConfigLoader given file-target entry with plain augmentColumns, when parsing, then accepts without mustache error
statusReason: [
  {
    "code": "custom",
    "message": "augmentColumns['OrgName'] uses {{targetOrg.*}} which is not allowed for file-target entries (targetOrg is absent)",
    "path": [
      "entries",
      0,
      "augmentColumns",

[Killed] BlockStatement
src/adapters/config-loader.ts:168:32
     sourceOrg: orgAlias,
     ...targetFields,
   })
-  .superRefine((entry, ctx) => {
-    validateTargetFields(entry, ctx)
-    if (!entry.targetOrg && entry.augmentColumns) {
-      rejectAugmentColumns(
-        entry.augmentColumns,
-        value => MUSTACHE_TARGETORG.test(value),
-        key =>
-          `augmentColumns['${key}'] uses {{targetOrg.*}} which is not allowed for file-target entries (targetOrg is absent)`,
-        ctx
-      )
-    }
-  })
+  .superRefine((entry, ctx) => {})
 
 const elfEntrySchema = baseEntrySchema
killedBy: ConfigLoader given elf entry {{targetOrg.Id}} in augmentColumns when no targetOrg, when parsing, then error path starts with augmentColumns
statusReason: Cannot read properties of undefined (reading 'some')

[Killed] BlockStatement
src/adapters/config-loader.ts:170:51
   })
   .superRefine((entry, ctx) => {
     validateTargetFields(entry, ctx)
-    if (!entry.targetOrg && entry.augmentColumns) {
-      rejectAugmentColumns(
-        entry.augmentColumns,
-        value => MUSTACHE_TARGETORG.test(value),
-        key =>
-          `augmentColumns['${key}'] uses {{targetOrg.*}} which is not allowed for file-target entries (targetOrg is absent)`,
-        ctx
-      )
-    }
+    if (!entry.targetOrg && entry.augmentColumns) {}
   })
 
killedBy: ConfigLoader given elf entry {{targetOrg.Id}} in augmentColumns when no targetOrg, when parsing, then error path starts with augmentColumns
statusReason: Cannot read properties of undefined (reading 'some')

[Killed] ConditionalExpression
src/adapters/config-loader.ts:170:9
   })
   .superRefine((entry, ctx) => {
     validateTargetFields(entry, ctx)
-    if (!entry.targetOrg && entry.augmentColumns) {
+    if (false) {
       rejectAugmentColumns(
         entry.augmentColumns,
killedBy: ConfigLoader given elf entry {{targetOrg.Id}} in augmentColumns when no targetOrg, when parsing, then error path starts with augmentColumns
statusReason: Cannot read properties of undefined (reading 'some')

[Killed] ArrowFunction
src/adapters/config-loader.ts:173:9
     if (!entry.targetOrg && entry.augmentColumns) {
       rejectAugmentColumns(
         entry.augmentColumns,
-        value => MUSTACHE_TARGETORG.test(value),
+        () => undefined,
         key =>
           `augmentColumns['${key}'] uses {{targetOrg.*}} which is not allowed for file-target entries (targetOrg is absent)`,
killedBy: ConfigLoader given elf entry {{targetOrg.Id}} in augmentColumns when no targetOrg, when parsing, then error path starts with augmentColumns
statusReason: Cannot read properties of undefined (reading 'some')

[Killed] ArrowFunction
src/adapters/config-loader.ts:174:9
       rejectAugmentColumns(
         entry.augmentColumns,
         value => MUSTACHE_TARGETORG.test(value),
-        key =>
-          `augmentColumns['${key}'] uses {{targetOrg.*}} which is not allowed for file-target entries (targetOrg is absent)`,
+        () => undefined,
         ctx
       )
killedBy: ConfigLoader given {{targetOrg.Id}} in augmentColumns when no targetOrg, when parsing, then rejects
statusReason: expected [Function] to throw error matching /targetOrg/ but got '[\n  {\n    "code": "custom",\n    "m…'

[Killed] StringLiteral
src/adapters/config-loader.ts:184:32
 const elfEntrySchema = baseEntrySchema
   .extend({
     eventLog: sfIdentifier,
-    interval: z.enum(['Daily', 'Hourly']),
+    interval: z.enum(['Daily', ""]),
   })
   .strict()
killedBy: ConfigLoader given elf entry with Hourly interval, when parsing, then accepts it
statusReason: [
  {
    "code": "invalid_union",
    "errors": [
      [
        {
          "code": "invalid_value",
          "values": [

[Killed] MethodExpression
src/adapters/config-loader.ts:191:13
 const sobjectEntrySchema = baseEntrySchema
   .extend({
     sObject: sfIdentifier,
-    fields: z.array(soqlRelationshipPath).min(1),
+    fields: z.array(soqlRelationshipPath).max(1),
     dateField: sfIdentifier.default('LastModifiedDate'),
     // Trust boundary: where clause is user-supplied SOQL interpolated directly into queries.
killedBy: ConfigLoader schema validation given valid SObject config, when loading, then returns resolved entries with default dateField
statusReason: [
  {
    "origin": "array",
    "code": "too_big",
    "maximum": 1,
    "inclusive": true,
    "path": [
      "entries",

[Killed] StringLiteral
src/adapters/config-loader.ts:192:37
   .extend({
     sObject: sfIdentifier,
     fields: z.array(soqlRelationshipPath).min(1),
-    dateField: sfIdentifier.default('LastModifiedDate'),
+    dateField: sfIdentifier.default(""),
     // Trust boundary: where clause is user-supplied SOQL interpolated directly into queries.
     // The config file is a trusted input — do not construct it from untrusted sources.
killedBy: ConfigLoader schema validation given valid SObject config, when loading, then returns resolved entries with default dateField
statusReason: expected '' to be 'LastModifiedDate' // Object.is equality

[Killed] MethodExpression
src/adapters/config-loader.ts:203:14
 const csvEntrySchema = z
   .object({
     name: entryName.optional(),
-    csvFile: z
-      .string()
-      .min(1)
+    csvFile: z.string().max(1)
       .refine(p => path.isAbsolute(p) || !path.normalize(p).startsWith('..'), {
         message: 'csvFile must not traverse parent directories',
killedBy: ConfigLoader CSV entry given valid CSV config with file target, when parsing, then returns csv entry
statusReason: [
  {
    "origin": "string",
    "code": "too_big",
    "maximum": 1,
    "inclusive": true,
    "path": [
      "entries",

[Killed] MethodExpression
src/adapters/config-loader.ts:206:43
     csvFile: z
       .string()
       .min(1)
-      .refine(p => path.isAbsolute(p) || !path.normalize(p).startsWith('..'), {
+      .refine(p => path.isAbsolute(p) || !path.normalize(p).endsWith('..'), {
         message: 'csvFile must not traverse parent directories',
       }),
killedBy: ConfigLoader CSV entry given CSV config with path traversal in csvFile, when parsing, then rejects
statusReason: promise resolved "{ entries: [ { …(3) } ] }" instead of rejecting

[Killed] BooleanLiteral
src/adapters/config-loader.ts:206:42
     csvFile: z
       .string()
       .min(1)
-      .refine(p => path.isAbsolute(p) || !path.normalize(p).startsWith('..'), {
+      .refine(p => path.isAbsolute(p) || path.normalize(p).startsWith('..'), {
         message: 'csvFile must not traverse parent directories',
       }),
killedBy: ConfigLoader CSV entry given valid CSV config with file target, when parsing, then returns csv entry
statusReason: [
  {
    "code": "custom",
    "path": [
      "entries",
      0,
      "csvFile"
    ],

[Killed] BlockStatement
src/adapters/config-loader.ts:212:32
     ...targetFields,
   })
   .strict()
-  .superRefine((entry, ctx) => {
-    validateTargetFields(entry, ctx)
-    if (entry.augmentColumns) {
-      rejectAugmentColumns(
-        entry.augmentColumns,
-        value =>
-          MUSTACHE_SOURCEORG.test(value) || MUSTACHE_TARGETORG.test(value),
-        key =>
-          `augmentColumns['${key}'] uses a dynamic expression which is not allowed for csv entries`,
-        ctx
-      )
-    }
-  })
+  .superRefine((entry, ctx) => {})
 
 const DISCRIMINATOR_FIELDS = ['eventLog', 'sObject', 'csvFile'] as const
killedBy: ConfigLoader CSV entry given CSV config with {{sourceOrg.Id}} in augmentColumns value, when parsing, then rejects
statusReason: promise resolved "{ entries: [ { …(4) } ] }" instead of rejecting

[Killed] ConditionalExpression
src/adapters/config-loader.ts:214:9
   .strict()
   .superRefine((entry, ctx) => {
     validateTargetFields(entry, ctx)
-    if (entry.augmentColumns) {
+    if (true) {
       rejectAugmentColumns(
         entry.augmentColumns,
killedBy: ConfigLoader CSV entry given valid CSV config with file target, when parsing, then returns csv entry
statusReason: Cannot convert undefined or null to object

[Killed] ConditionalExpression
src/adapters/config-loader.ts:214:9
   .strict()
   .superRefine((entry, ctx) => {
     validateTargetFields(entry, ctx)
-    if (entry.augmentColumns) {
+    if (false) {
       rejectAugmentColumns(
         entry.augmentColumns,
killedBy: ConfigLoader CSV entry given CSV config with {{sourceOrg.Id}} in augmentColumns value, when parsing, then rejects
statusReason: promise resolved "{ entries: [ { …(4) } ] }" instead of rejecting

[Killed] ArrowFunction
src/adapters/config-loader.ts:217:9
     if (entry.augmentColumns) {
       rejectAugmentColumns(
         entry.augmentColumns,
-        value =>
-          MUSTACHE_SOURCEORG.test(value) || MUSTACHE_TARGETORG.test(value),
+        () => undefined,
         key =>
           `augmentColumns['${key}'] uses a dynamic expression which is not allowed for csv entries`,
killedBy: ConfigLoader CSV entry given CSV config with {{sourceOrg.Id}} in augmentColumns value, when parsing, then rejects
statusReason: promise resolved "{ entries: [ { …(4) } ] }" instead of rejecting

[Killed] ConditionalExpression
src/adapters/config-loader.ts:218:11
       rejectAugmentColumns(
         entry.augmentColumns,
         value =>
-          MUSTACHE_SOURCEORG.test(value) || MUSTACHE_TARGETORG.test(value),
+          true,
         key =>
           `augmentColumns['${key}'] uses a dynamic expression which is not allowed for csv entries`,
killedBy: ConfigLoader CSV entry given CSV config with static augmentColumns value, when parsing, then accepts it as literal
statusReason: promise rejected "ZodError: [
  {
    "code": "custom",
   … { …(8) }" instead of resolving

[Killed] LogicalOperator
src/adapters/config-loader.ts:218:11
       rejectAugmentColumns(
         entry.augmentColumns,
         value =>
-          MUSTACHE_SOURCEORG.test(value) || MUSTACHE_TARGETORG.test(value),
+          MUSTACHE_SOURCEORG.test(value) && MUSTACHE_TARGETORG.test(value),
         key =>
           `augmentColumns['${key}'] uses a dynamic expression which is not allowed for csv entries`,
killedBy: ConfigLoader CSV entry given CSV config with {{sourceOrg.Id}} in augmentColumns value, when parsing, then rejects
statusReason: promise resolved "{ entries: [ { …(4) } ] }" instead of rejecting

[Killed] ArrowFunction
src/adapters/config-loader.ts:219:9
         entry.augmentColumns,
         value =>
           MUSTACHE_SOURCEORG.test(value) || MUSTACHE_TARGETORG.test(value),
-        key =>
-          `augmentColumns['${key}'] uses a dynamic expression which is not allowed for csv entries`,
+        () => undefined,
         ctx
       )
killedBy: ConfigLoader CSV entry given CSV config with {{sourceOrg.Id}} in augmentColumns value, when parsing, then rejects
statusReason: expected [Function] to throw error including 'dynamic expression' but got '[\n  {\n    "code": "custom",\n    "m…'

[Timeout] BlockStatement
src/adapters/config-loader.ts:228:55
 
 const DISCRIMINATOR_FIELDS = ['eventLog', 'sObject', 'csvFile'] as const
 
-const entrySchema = z.any().superRefine((val, ctx) => {
-  if (typeof val !== 'object' || val === null || Array.isArray(val)) {
-    ctx.addIssue({
-      code: z.ZodIssueCode.custom,
-      message: 'Entry must be an object',
-    })
-    return
-  }
-  const obj = val as Record<string, unknown>
-  const present = DISCRIMINATOR_FIELDS.filter(k => k in obj)
-  if (present.length === 0) {
-    ctx.addIssue({
-      code: z.ZodIssueCode.custom,
-      message:
-        'Entry must have one of: eventLog (ELF), sObject (SObject), or csvFile (CSV)',
-    })
-  }
-  if (present.length > 1) {
-    ctx.addIssue({
-      code: z.ZodIssueCode.custom,
-      message: `Entry must have exactly one of eventLog, sObject, or csvFile — found: ${present.join(', ')}`,
-    })
-  }
-}).pipe(z.union([elfEntrySchema, sobjectEntrySchema, csvEntrySchema]))
+const entrySchema = z.any().superRefine((val, ctx) => {}).pipe(z.union([elfEntrySchema, sobjectEntrySchema, csvEntrySchema]))
 
 const configSchema = z.object({

[Killed] BlockStatement
src/adapters/config-loader.ts:229:70
 const DISCRIMINATOR_FIELDS = ['eventLog', 'sObject', 'csvFile'] as const
 
 const entrySchema = z.any().superRefine((val, ctx) => {
-  if (typeof val !== 'object' || val === null || Array.isArray(val)) {
-    ctx.addIssue({
-      code: z.ZodIssueCode.custom,
-      message: 'Entry must be an object',
-    })
-    return
-  }
+  if (typeof val !== 'object' || val === null || Array.isArray(val)) {}
   const obj = val as Record<string, unknown>
   const present = DISCRIMINATOR_FIELDS.filter(k => k in obj)
killedBy: ConfigLoader schema validation given null entry, when loading, then throws validation error
statusReason: expected [Function] to throw error including 'Entry must be an object' but got 'Cannot use \'in\' operator to search …'

[Killed] EqualityOperator
src/adapters/config-loader.ts:229:7
 const DISCRIMINATOR_FIELDS = ['eventLog', 'sObject', 'csvFile'] as const
 
 const entrySchema = z.any().superRefine((val, ctx) => {
-  if (typeof val !== 'object' || val === null || Array.isArray(val)) {
+  if (typeof val === 'object' || val === null || Array.isArray(val)) {
     ctx.addIssue({
       code: z.ZodIssueCode.custom,
killedBy: ConfigLoader schema validation given valid ELF config, when loading, then returns resolved entries
statusReason: [
  {
    "code": "custom",
    "message": "Entry must be an object",
    "path": [
      "entries",
      0
    ]

[Killed] ObjectLiteral
src/adapters/config-loader.ts:230:18
 
 const entrySchema = z.any().superRefine((val, ctx) => {
   if (typeof val !== 'object' || val === null || Array.isArray(val)) {
-    ctx.addIssue({
-      code: z.ZodIssueCode.custom,
-      message: 'Entry must be an object',
-    })
+    ctx.addIssue({})
     return
   }
killedBy: ConfigLoader schema validation given null entry, when loading, then throws validation error
statusReason: expected [Function] to throw error including 'Entry must be an object' but got '[\n  {\n    "code": "custom",\n    "p…'

[Killed] StringLiteral
src/adapters/config-loader.ts:232:16
   if (typeof val !== 'object' || val === null || Array.isArray(val)) {
     ctx.addIssue({
       code: z.ZodIssueCode.custom,
-      message: 'Entry must be an object',
+      message: "",
     })
     return
killedBy: ConfigLoader schema validation given null entry, when loading, then throws validation error
statusReason: expected [Function] to throw error including 'Entry must be an object' but got '[\n  {\n    "code": "custom",\n    "m…'
