[Killed] MethodExpression
src/adapters/config-loader.ts:237:19
     return
   }
   const obj = val as Record<string, unknown>
-  const present = DISCRIMINATOR_FIELDS.filter(k => k in obj)
+  const present = DISCRIMINATOR_FIELDS
   if (present.length === 0) {
     ctx.addIssue({
killedBy: ConfigLoader schema validation given valid ELF config, when loading, then returns resolved entries
statusReason: [
  {
    "code": "custom",
    "message": "Entry must have exactly one of eventLog, sObject, or csvFile — found: eventLog, sObject, csvFile",
    "path": [
      "entries",
      0
    ]

[Killed] ArrowFunction
src/adapters/config-loader.ts:237:47
     return
   }
   const obj = val as Record<string, unknown>
-  const present = DISCRIMINATOR_FIELDS.filter(k => k in obj)
+  const present = DISCRIMINATOR_FIELDS.filter(() => undefined)
   if (present.length === 0) {
     ctx.addIssue({
killedBy: ConfigLoader schema validation given valid ELF config, when loading, then returns resolved entries
statusReason: [
  {
    "code": "custom",
    "message": "Entry must have one of: eventLog (ELF), sObject (SObject), or csvFile (CSV)",
    "path": [
      "entries",
      0
    ]

[Killed] EqualityOperator
src/adapters/config-loader.ts:238:7
   }
   const obj = val as Record<string, unknown>
   const present = DISCRIMINATOR_FIELDS.filter(k => k in obj)
-  if (present.length === 0) {
+  if (present.length !== 0) {
     ctx.addIssue({
       code: z.ZodIssueCode.custom,
killedBy: DatasetLoad NUT command validation given valid config with entries, when specifying nonexistent entry name, then produces entry not found error
statusReason: expected [Function] to throw error including 'Entry \'nonexistent\' not found. Ensu…' but got 'Config loading failed: [\n  {\n    "c…'

[Killed] ConditionalExpression
src/adapters/config-loader.ts:238:7
   }
   const obj = val as Record<string, unknown>
   const present = DISCRIMINATOR_FIELDS.filter(k => k in obj)
-  if (present.length === 0) {
+  if (true) {
     ctx.addIssue({
       code: z.ZodIssueCode.custom,
killedBy: ConfigLoader schema validation given valid ELF config, when loading, then returns resolved entries
statusReason: [
  {
    "code": "custom",
    "message": "Entry must have one of: eventLog (ELF), sObject (SObject), or csvFile (CSV)",
    "path": [
      "entries",
      0
    ]

[Killed] ObjectLiteral
src/adapters/config-loader.ts:239:18
   const obj = val as Record<string, unknown>
   const present = DISCRIMINATOR_FIELDS.filter(k => k in obj)
   if (present.length === 0) {
-    ctx.addIssue({
-      code: z.ZodIssueCode.custom,
-      message:
-        'Entry must have one of: eventLog (ELF), sObject (SObject), or csvFile (CSV)',
-    })
+    ctx.addIssue({})
   }
   if (present.length > 1) {
killedBy: ConfigLoader schema validation given entry with no discriminating field, when loading, then throws descriptive error
statusReason: expected [Function] to throw error including 'Entry must have one of: eventLog (ELF…' but got '[\n  {\n    "code": "custom",\n    "p…'

[Killed] ConditionalExpression
src/adapters/config-loader.ts:245:7
         'Entry must have one of: eventLog (ELF), sObject (SObject), or csvFile (CSV)',
     })
   }
-  if (present.length > 1) {
+  if (false) {
     ctx.addIssue({
       code: z.ZodIssueCode.custom,
killedBy: ConfigLoader schema validation given entry with multiple discriminator fields, when loading, then throws ambiguity error
statusReason: expected [Function] to throw error including 'found: eventLog, sObject' but got '[\n  {\n    "code": "invalid_union",\…'

[Killed] EqualityOperator
src/adapters/config-loader.ts:245:7
         'Entry must have one of: eventLog (ELF), sObject (SObject), or csvFile (CSV)',
     })
   }
-  if (present.length > 1) {
+  if (present.length >= 1) {
     ctx.addIssue({
       code: z.ZodIssueCode.custom,
killedBy: ConfigLoader schema validation given valid ELF config, when loading, then returns resolved entries
statusReason: [
  {
    "code": "custom",
    "message": "Entry must have exactly one of eventLog, sObject, or csvFile — found: eventLog",
    "path": [
      "entries",
      0
    ]

[Killed] ObjectLiteral
src/adapters/config-loader.ts:246:18
     })
   }
   if (present.length > 1) {
-    ctx.addIssue({
-      code: z.ZodIssueCode.custom,
-      message: `Entry must have exactly one of eventLog, sObject, or csvFile — found: ${present.join(', ')}`,
-    })
+    ctx.addIssue({})
   }
 }).pipe(z.union([elfEntrySchema, sobjectEntrySchema, csvEntrySchema]))
killedBy: ConfigLoader schema validation given entry with multiple discriminator fields, when loading, then throws ambiguity error
statusReason: expected [Function] to throw error including 'found: eventLog, sObject' but got '[\n  {\n    "code": "custom",\n    "p…'

[Killed] StringLiteral
src/adapters/config-loader.ts:248:102
   if (present.length > 1) {
     ctx.addIssue({
       code: z.ZodIssueCode.custom,
-      message: `Entry must have exactly one of eventLog, sObject, or csvFile — found: ${present.join(', ')}`,
+      message: `Entry must have exactly one of eventLog, sObject, or csvFile — found: ${present.join("")}`,
     })
   }
killedBy: ConfigLoader schema validation given entry with multiple discriminator fields, when loading, then throws ambiguity error
statusReason: expected [Function] to throw error including 'found: eventLog, sObject' but got '[\n  {\n    "code": "custom",\n    "m…'

[Killed] StringLiteral
src/adapters/config-loader.ts:248:16
   if (present.length > 1) {
     ctx.addIssue({
       code: z.ZodIssueCode.custom,
-      message: `Entry must have exactly one of eventLog, sObject, or csvFile — found: ${present.join(', ')}`,
+      message: ``,
     })
   }
killedBy: ConfigLoader schema validation given entry with multiple discriminator fields, when loading, then throws ambiguity error
statusReason: expected [Function] to throw error including 'found: eventLog, sObject' but got '[\n  {\n    "code": "custom",\n    "m…'

[Survived] ArrayDeclaration
src/adapters/config-loader.ts:251:17
       message: `Entry must have exactly one of eventLog, sObject, or csvFile — found: ${present.join(', ')}`,
     })
   }
-}).pipe(z.union([elfEntrySchema, sobjectEntrySchema, csvEntrySchema]))
+}).pipe(z.union([]))
 
 const configSchema = z.object({

[Killed] MethodExpression
src/adapters/config-loader.ts:254:12
 }).pipe(z.union([elfEntrySchema, sobjectEntrySchema, csvEntrySchema]))
 
 const configSchema = z.object({
-  entries: z.array(entrySchema).min(1),
+  entries: z.array(entrySchema).max(1),
 })
 
killedBy: DatasetLoad NUT dry-run given valid config with multiple named entries, when running with dry-run and entry filter by name, then returns zero counts for filtered entry
statusReason: Config loading failed: [
  {
    "origin": "array",
    "code": "too_big",
    "maximum": 1,
    "inclusive": true,
    "path": [
      "entries"

[Killed] BlockStatement
src/adapters/config-loader.ts:262:65
   Name: string
 }
 
-function collectUniqueOrgs(entries: ConfigEntry[]): Set<string> {
-  const orgs = new Set<string>()
-  for (const entry of entries) {
-    if (isCsvEntry(entry)) continue
-    const columns = entry.augmentColumns ?? {}
-    for (const value of Object.values(columns)) {
-      if (MUSTACHE_SOURCEORG.test(value)) orgs.add(entry.sourceOrg)
-      if (MUSTACHE_TARGETORG.test(value) && entry.targetOrg)
-        orgs.add(entry.targetOrg)
-    }
-  }
-  return orgs
-}
+function collectUniqueOrgs(entries: ConfigEntry[]): Set<string> {}
 
 function groupEntriesByDatasetKey(
killedBy: ConfigLoader schema validation given valid ELF config, when loading, then returns resolved entries
statusReason: orgsToResolve is not iterable

[Killed] BlockStatement
src/adapters/config-loader.ts:264:32
 
 function collectUniqueOrgs(entries: ConfigEntry[]): Set<string> {
   const orgs = new Set<string>()
-  for (const entry of entries) {
-    if (isCsvEntry(entry)) continue
-    const columns = entry.augmentColumns ?? {}
-    for (const value of Object.values(columns)) {
-      if (MUSTACHE_SOURCEORG.test(value)) orgs.add(entry.sourceOrg)
-      if (MUSTACHE_TARGETORG.test(value) && entry.targetOrg)
-        orgs.add(entry.targetOrg)
-    }
-  }
+  for (const entry of entries) {}
   return orgs
 }
killedBy: ConfigLoader augment column resolution given {{sourceOrg.Id}} mustache token, when loading, then resolves to source org id
statusReason: Org info not resolved for 'source'

[Killed] ConditionalExpression
src/adapters/config-loader.ts:265:9
 function collectUniqueOrgs(entries: ConfigEntry[]): Set<string> {
   const orgs = new Set<string>()
   for (const entry of entries) {
-    if (isCsvEntry(entry)) continue
+    if (true) continue
     const columns = entry.augmentColumns ?? {}
     for (const value of Object.values(columns)) {
killedBy: ConfigLoader augment column resolution given {{sourceOrg.Id}} mustache token, when loading, then resolves to source org id
statusReason: Org info not resolved for 'source'

[Survived] ConditionalExpression
src/adapters/config-loader.ts:265:9
 function collectUniqueOrgs(entries: ConfigEntry[]): Set<string> {
   const orgs = new Set<string>()
   for (const entry of entries) {
-    if (isCsvEntry(entry)) continue
+    if (false) continue
     const columns = entry.augmentColumns ?? {}
     for (const value of Object.values(columns)) {

[Killed] LogicalOperator
src/adapters/config-loader.ts:266:21
   const orgs = new Set<string>()
   for (const entry of entries) {
     if (isCsvEntry(entry)) continue
-    const columns = entry.augmentColumns ?? {}
+    const columns = entry.augmentColumns && {}
     for (const value of Object.values(columns)) {
       if (MUSTACHE_SOURCEORG.test(value)) orgs.add(entry.sourceOrg)
killedBy: ConfigLoader schema validation given valid ELF config, when loading, then returns resolved entries
statusReason: Cannot convert undefined or null to object

[Killed] BlockStatement
src/adapters/config-loader.ts:267:49
   for (const entry of entries) {
     if (isCsvEntry(entry)) continue
     const columns = entry.augmentColumns ?? {}
-    for (const value of Object.values(columns)) {
-      if (MUSTACHE_SOURCEORG.test(value)) orgs.add(entry.sourceOrg)
-      if (MUSTACHE_TARGETORG.test(value) && entry.targetOrg)
-        orgs.add(entry.targetOrg)
-    }
+    for (const value of Object.values(columns)) {}
   }
   return orgs
killedBy: ConfigLoader augment column resolution given {{sourceOrg.Id}} mustache token, when loading, then resolves to source org id
statusReason: Org info not resolved for 'source'

[Killed] ConditionalExpression
src/adapters/config-loader.ts:268:11
     if (isCsvEntry(entry)) continue
     const columns = entry.augmentColumns ?? {}
     for (const value of Object.values(columns)) {
-      if (MUSTACHE_SOURCEORG.test(value)) orgs.add(entry.sourceOrg)
+      if (true) orgs.add(entry.sourceOrg)
       if (MUSTACHE_TARGETORG.test(value) && entry.targetOrg)
         orgs.add(entry.targetOrg)
killedBy: ConfigLoader augment column resolution given targetOrg Name expression, when loading, then resolves to target org name
statusReason: No authenticated connection for org 'source'

[Killed] ConditionalExpression
src/adapters/config-loader.ts:268:11
     if (isCsvEntry(entry)) continue
     const columns = entry.augmentColumns ?? {}
     for (const value of Object.values(columns)) {
-      if (MUSTACHE_SOURCEORG.test(value)) orgs.add(entry.sourceOrg)
+      if (false) orgs.add(entry.sourceOrg)
       if (MUSTACHE_TARGETORG.test(value) && entry.targetOrg)
         orgs.add(entry.targetOrg)
killedBy: ConfigLoader augment column resolution given {{sourceOrg.Id}} mustache token, when loading, then resolves to source org id
statusReason: Org info not resolved for 'source'

[Killed] ConditionalExpression
src/adapters/config-loader.ts:269:11
     const columns = entry.augmentColumns ?? {}
     for (const value of Object.values(columns)) {
       if (MUSTACHE_SOURCEORG.test(value)) orgs.add(entry.sourceOrg)
-      if (MUSTACHE_TARGETORG.test(value) && entry.targetOrg)
+      if (true)
         orgs.add(entry.targetOrg)
     }
killedBy: ConfigLoader augment column resolution given org query returns no records, when loading, then throws error
statusReason: expected [Function] to throw error matching /Organization query returned no records/ but got 'No authenticated connection for org \…'

[Killed] ConditionalExpression
src/adapters/config-loader.ts:269:11
     const columns = entry.augmentColumns ?? {}
     for (const value of Object.values(columns)) {
       if (MUSTACHE_SOURCEORG.test(value)) orgs.add(entry.sourceOrg)
-      if (MUSTACHE_TARGETORG.test(value) && entry.targetOrg)
+      if (false)
         orgs.add(entry.targetOrg)
     }
killedBy: ConfigLoader augment column resolution given multiple mustache tokens in same value, when loading, then resolves all
statusReason: Org info not resolved for 'analytic'

[Killed] EqualityOperator
src/adapters/config-loader.ts:287:19
     { datasetKey: DatasetKey; ops: { operation: string; indices: number[] }[] }
   >()
 
-  for (let i = 0; i < entries.length; i++) {
+  for (let i = 0; i >= entries.length; i++) {
     const entry = entries[i]
     const datasetKey = DatasetKey.fromEntry(entry)
killedBy: ConfigLoader operation consistency given entries with conflicting operations on same dataset, when loading, then throws error
statusReason: promise resolved "[ { entry: { …(6) }, …(2) }, …(1) ]" instead of rejecting

[Killed] EqualityOperator
src/adapters/config-loader.ts:287:19
     { datasetKey: DatasetKey; ops: { operation: string; indices: number[] }[] }
   >()
 
-  for (let i = 0; i < entries.length; i++) {
+  for (let i = 0; i <= entries.length; i++) {
     const entry = entries[i]
     const datasetKey = DatasetKey.fromEntry(entry)
killedBy: ConfigLoader schema validation given valid ELF config, when loading, then returns resolved entries
statusReason: Cannot read properties of undefined (reading 'targetOrg')

[Killed] ConditionalExpression
src/adapters/config-loader.ts:293:9
     const mapKey = datasetKey.toString()
     const operation = entry.operation
 
-    if (!groups.has(mapKey)) {
+    if (true) {
       groups.set(mapKey, { datasetKey, ops: [] })
     }
killedBy: ConfigLoader operation consistency given entries with conflicting operations on same dataset, when loading, then throws error
statusReason: promise resolved "[ { entry: { …(6) }, …(2) }, …(1) ]" instead of rejecting

[Killed] ConditionalExpression
src/adapters/config-loader.ts:293:9
     const mapKey = datasetKey.toString()
     const operation = entry.operation
 
-    if (!groups.has(mapKey)) {
+    if (false) {
       groups.set(mapKey, { datasetKey, ops: [] })
     }
killedBy: ConfigLoader schema validation given valid ELF config, when loading, then returns resolved entries
statusReason: Cannot read properties of undefined (reading 'ops')

[Killed] ArrayDeclaration
src/adapters/config-loader.ts:294:45
     const operation = entry.operation
 
     if (!groups.has(mapKey)) {
-      groups.set(mapKey, { datasetKey, ops: [] })
+      groups.set(mapKey, { datasetKey, ops: ["Stryker was here"] })
     }
     const group = groups.get(mapKey)!
killedBy: ConfigLoader schema validation given valid ELF config, when loading, then returns resolved entries
statusReason: Cannot read properties of undefined (reading 'join')

[Killed] ConditionalExpression
src/adapters/config-loader.ts:297:42
       groups.set(mapKey, { datasetKey, ops: [] })
     }
     const group = groups.get(mapKey)!
-    const existing = group.ops.find(g => g.operation === operation)
+    const existing = group.ops.find(g => true)
     if (existing) {
       existing.indices.push(i)
killedBy: ConfigLoader operation consistency given entries with conflicting operations on same dataset, when loading, then throws error
statusReason: promise resolved "[ { entry: { …(6) }, …(2) }, …(1) ]" instead of rejecting

[Killed] ArrowFunction
src/adapters/config-loader.ts:297:37
       groups.set(mapKey, { datasetKey, ops: [] })
     }
     const group = groups.get(mapKey)!
-    const existing = group.ops.find(g => g.operation === operation)
+    const existing = group.ops.find(() => undefined)
     if (existing) {
       existing.indices.push(i)
killedBy: ConfigLoader operation consistency given entries with same operation on same dataset, when loading, then succeeds
statusReason: Entries target dataset 'org:ana:DS' but specify conflicting operations: 'Append' (entries 0) vs 'Append' (entries 1)

[Killed] ConditionalExpression
src/adapters/config-loader.ts:298:9
     }
     const group = groups.get(mapKey)!
     const existing = group.ops.find(g => g.operation === operation)
-    if (existing) {
+    if (true) {
       existing.indices.push(i)
     } else {
killedBy: ConfigLoader schema validation given valid ELF config, when loading, then returns resolved entries
statusReason: Cannot read properties of undefined (reading 'indices')

[Killed] ConditionalExpression
src/adapters/config-loader.ts:298:9
     }
     const group = groups.get(mapKey)!
     const existing = group.ops.find(g => g.operation === operation)
-    if (existing) {
+    if (false) {
       existing.indices.push(i)
     } else {
killedBy: ConfigLoader operation consistency given entries with same operation on same dataset, when loading, then succeeds
statusReason: Entries target dataset 'org:ana:DS' but specify conflicting operations: 'Append' (entries 0) vs 'Append' (entries 1)

[Killed] BlockStatement
src/adapters/config-loader.ts:300:12
     const existing = group.ops.find(g => g.operation === operation)
     if (existing) {
       existing.indices.push(i)
-    } else {
-      group.ops.push({ operation, indices: [i] })
-    }
+    } else {}
   }
 
killedBy: ConfigLoader operation consistency given entries with conflicting operations on same dataset, when loading, then throws error
statusReason: promise resolved "[ { entry: { …(6) }, …(2) }, …(1) ]" instead of rejecting

[Killed] BlockStatement
src/adapters/config-loader.ts:308:69
   return groups
 }
 
-function validateOperationConsistency(entries: ConfigEntry[]): void {
-  const groups = groupEntriesByDatasetKey(entries)
-
-  for (const [, { datasetKey, ops }] of groups) {
-    if (ops.length > 1) {
-      const details = ops
-        .map(o => `'${o.operation}' (entries ${o.indices.join(', ')})`)
-        .join(' vs ')
-      throw new Error(
-        `Entries target dataset '${datasetKey.toString()}' but specify conflicting operations: ${details}`
-      )
-    }
-  }
-}
+function validateOperationConsistency(entries: ConfigEntry[]): void {}
 
 function validateNameUniqueness(entries: ConfigEntry[]): void {
killedBy: ConfigLoader operation consistency given entries with conflicting operations on same dataset, when loading, then throws error
statusReason: promise resolved "[ { entry: { …(6) }, …(2) }, …(1) ]" instead of rejecting

[Killed] BlockStatement
src/adapters/config-loader.ts:311:49
 function validateOperationConsistency(entries: ConfigEntry[]): void {
   const groups = groupEntriesByDatasetKey(entries)
 
-  for (const [, { datasetKey, ops }] of groups) {
-    if (ops.length > 1) {
-      const details = ops
-        .map(o => `'${o.operation}' (entries ${o.indices.join(', ')})`)
-        .join(' vs ')
-      throw new Error(
-        `Entries target dataset '${datasetKey.toString()}' but specify conflicting operations: ${details}`
-      )
-    }
-  }
+  for (const [, { datasetKey, ops }] of groups) {}
 }
 
killedBy: ConfigLoader operation consistency given entries with conflicting operations on same dataset, when loading, then throws error
statusReason: promise resolved "[ { entry: { …(6) }, …(2) }, …(1) ]" instead of rejecting

[Killed] EqualityOperator
src/adapters/config-loader.ts:312:9
   const groups = groupEntriesByDatasetKey(entries)
 
   for (const [, { datasetKey, ops }] of groups) {
-    if (ops.length > 1) {
+    if (ops.length <= 1) {
       const details = ops
         .map(o => `'${o.operation}' (entries ${o.indices.join(', ')})`)
killedBy: ConfigLoader schema validation given valid ELF config, when loading, then returns resolved entries
statusReason: Entries target dataset 'org:analytic:DS_ELF' but specify conflicting operations: 'Append' (entries 0)

[Killed] ConditionalExpression
src/adapters/config-loader.ts:312:9
   const groups = groupEntriesByDatasetKey(entries)
 
   for (const [, { datasetKey, ops }] of groups) {
-    if (ops.length > 1) {
+    if (false) {
       const details = ops
         .map(o => `'${o.operation}' (entries ${o.indices.join(', ')})`)
killedBy: ConfigLoader operation consistency given entries with conflicting operations on same dataset, when loading, then throws error
statusReason: promise resolved "[ { entry: { …(6) }, …(2) }, …(1) ]" instead of rejecting

[Killed] ArrowFunction
src/adapters/config-loader.ts:314:14
   for (const [, { datasetKey, ops }] of groups) {
     if (ops.length > 1) {
       const details = ops
-        .map(o => `'${o.operation}' (entries ${o.indices.join(', ')})`)
+        .map(() => undefined)
         .join(' vs ')
       throw new Error(
killedBy: ConfigLoader validateOperationConsistency error detail given conflicting operations, when parsing, then error message contains operation names
statusReason: expected [Function] to throw error including '\'Append\'' but got 'Entries target dataset \'org:ana:DS\'…'

[Killed] StringLiteral
src/adapters/config-loader.ts:314:19
   for (const [, { datasetKey, ops }] of groups) {
     if (ops.length > 1) {
       const details = ops
-        .map(o => `'${o.operation}' (entries ${o.indices.join(', ')})`)
+        .map(o => ``)
         .join(' vs ')
       throw new Error(
killedBy: ConfigLoader validateOperationConsistency error detail given conflicting operations, when parsing, then error message contains operation names
statusReason: expected [Function] to throw error including '\'Append\'' but got 'Entries target dataset \'org:ana:DS\'…'

[Killed] StringLiteral
src/adapters/config-loader.ts:317:9
         .map(o => `'${o.operation}' (entries ${o.indices.join(', ')})`)
         .join(' vs ')
       throw new Error(
-        `Entries target dataset '${datasetKey.toString()}' but specify conflicting operations: ${details}`
+        ``
       )
     }
killedBy: ConfigLoader operation consistency given entries with conflicting operations on same dataset, when loading, then throws error
statusReason: expected [Function] to throw error matching /conflicting operations/ but got ''

[Killed] BlockStatement
src/adapters/config-loader.ts:323:63
   }
 }
 
-function validateNameUniqueness(entries: ConfigEntry[]): void {
-  const seen = new Map<string, number>()
-  for (let i = 0; i < entries.length; i++) {
-    const name = entries[i].name
-    if (!name) continue
-    const previousIndex = seen.get(name)
-    if (previousIndex !== undefined) {
-      throw new Error(
-        `Duplicate entry name '${name}' at indices ${previousIndex} and ${i}`
-      )
-    }
-    seen.set(name, i)
-  }
-}
+function validateNameUniqueness(entries: ConfigEntry[]): void {}
 
 function validateAugmentColumnConsistency(entries: ConfigEntry[]): void {
killedBy: ConfigLoader name uniqueness given entries with duplicate names, when parsing, then throws error with indices
statusReason: promise resolved "{ entries: [ { …(7) }, …(2) ] }" instead of rejecting

[Killed] BlockStatement
src/adapters/config-loader.ts:325:44
 
 function validateNameUniqueness(entries: ConfigEntry[]): void {
   const seen = new Map<string, number>()
-  for (let i = 0; i < entries.length; i++) {
-    const name = entries[i].name
-    if (!name) continue
-    const previousIndex = seen.get(name)
-    if (previousIndex !== undefined) {
-      throw new Error(
-        `Duplicate entry name '${name}' at indices ${previousIndex} and ${i}`
-      )
-    }
-    seen.set(name, i)
-  }
+  for (let i = 0; i < entries.length; i++) {}
 }
 
killedBy: ConfigLoader name uniqueness given entries with duplicate names, when parsing, then throws error with indices
statusReason: promise resolved "{ entries: [ { …(7) }, …(2) ] }" instead of rejecting

[Killed] EqualityOperator
src/adapters/config-loader.ts:325:19
 
 function validateNameUniqueness(entries: ConfigEntry[]): void {
   const seen = new Map<string, number>()
-  for (let i = 0; i < entries.length; i++) {
+  for (let i = 0; i >= entries.length; i++) {
     const name = entries[i].name
     if (!name) continue
killedBy: ConfigLoader name uniqueness given entries with duplicate names, when parsing, then throws error with indices
statusReason: promise resolved "{ entries: [ { …(7) }, …(2) ] }" instead of rejecting

[Killed] BooleanLiteral
src/adapters/config-loader.ts:327:9
   const seen = new Map<string, number>()
   for (let i = 0; i < entries.length; i++) {
     const name = entries[i].name
-    if (!name) continue
+    if (name) continue
     const previousIndex = seen.get(name)
     if (previousIndex !== undefined) {
killedBy: ConfigLoader operation consistency given entries with same operation on same dataset, when loading, then succeeds
statusReason: Duplicate entry name 'undefined' at indices 0 and 1

[Killed] ConditionalExpression
src/adapters/config-loader.ts:327:9
   const seen = new Map<string, number>()
   for (let i = 0; i < entries.length; i++) {
     const name = entries[i].name
-    if (!name) continue
+    if (false) continue
     const previousIndex = seen.get(name)
     if (previousIndex !== undefined) {
killedBy: ConfigLoader operation consistency given entries with same operation on same dataset, when loading, then succeeds
statusReason: Duplicate entry name 'undefined' at indices 0 and 1

[Killed] ConditionalExpression
src/adapters/config-loader.ts:329:9
     const name = entries[i].name
     if (!name) continue
     const previousIndex = seen.get(name)
-    if (previousIndex !== undefined) {
+    if (true) {
       throw new Error(
         `Duplicate entry name '${name}' at indices ${previousIndex} and ${i}`
killedBy: ConfigLoader schema validation given ELF config with name field, when parsing, then preserves name in entry
statusReason: Duplicate entry name 'login-events' at indices undefined and 0

[Killed] ConditionalExpression
src/adapters/config-loader.ts:329:9
     const name = entries[i].name
     if (!name) continue
     const previousIndex = seen.get(name)
-    if (previousIndex !== undefined) {
+    if (false) {
       throw new Error(
         `Duplicate entry name '${name}' at indices ${previousIndex} and ${i}`
killedBy: ConfigLoader name uniqueness given entries with duplicate names, when parsing, then throws error with indices
statusReason: promise resolved "{ entries: [ { …(7) }, …(2) ] }" instead of rejecting

[Killed] BlockStatement
src/adapters/config-loader.ts:338:73
   }
 }
 
-function validateAugmentColumnConsistency(entries: ConfigEntry[]): void {
-  const groups = groupEntriesByDatasetKey(entries)
-
-  for (const [, { datasetKey, ops }] of groups) {
-    const groupEntries = ops.flatMap(o => o.indices).map(i => entries[i])
-    if (groupEntries.length < 2) continue
-
-    const firstKeys = Object.keys(groupEntries[0].augmentColumns ?? {})
-      .sort()
-      .join(',')
-    for (const entry of groupEntries.slice(1)) {
-      const keys = Object.keys(entry.augmentColumns ?? {})
-        .sort()
-        .join(',')
-      if (firstKeys !== keys) {
-        throw new Error(
-          `Entries targeting '${datasetKey.toString()}' have different augment column names: [${firstKeys}] vs [${keys}]`
-        )
-      }
-    }
-  }
-}
+function validateAugmentColumnConsistency(entries: ConfigEntry[]): void {}
 
 function validateSObjectFieldConsistency(entries: ConfigEntry[]): void {
killedBy: ConfigLoader augment consistency given two entries sharing DatasetKey with different augment column names, when parsing, then throws
statusReason: promise resolved "{ entries: [ { …(7) }, { …(7) } ] }" instead of rejecting

[Killed] BlockStatement
src/adapters/config-loader.ts:341:49
 function validateAugmentColumnConsistency(entries: ConfigEntry[]): void {
   const groups = groupEntriesByDatasetKey(entries)
 
-  for (const [, { datasetKey, ops }] of groups) {
-    const groupEntries = ops.flatMap(o => o.indices).map(i => entries[i])
-    if (groupEntries.length < 2) continue
-
-    const firstKeys = Object.keys(groupEntries[0].augmentColumns ?? {})
-      .sort()
-      .join(',')
-    for (const entry of groupEntries.slice(1)) {
-      const keys = Object.keys(entry.augmentColumns ?? {})
-        .sort()
-        .join(',')
-      if (firstKeys !== keys) {
-        throw new Error(
-          `Entries targeting '${datasetKey.toString()}' have different augment column names: [${firstKeys}] vs [${keys}]`
-        )
-      }
-    }
-  }
+  for (const [, { datasetKey, ops }] of groups) {}
 }
 
killedBy: ConfigLoader augment consistency given two entries sharing DatasetKey with different augment column names, when parsing, then throws
statusReason: promise resolved "{ entries: [ { …(7) }, { …(7) } ] }" instead of rejecting

[Killed] ArrowFunction
src/adapters/config-loader.ts:342:38
   const groups = groupEntriesByDatasetKey(entries)
 
   for (const [, { datasetKey, ops }] of groups) {
-    const groupEntries = ops.flatMap(o => o.indices).map(i => entries[i])
+    const groupEntries = ops.flatMap(() => undefined).map(i => entries[i])
     if (groupEntries.length < 2) continue
 
killedBy: ConfigLoader augment consistency given two entries sharing DatasetKey with different augment column names, when parsing, then throws
statusReason: promise resolved "{ entries: [ { …(7) }, { …(7) } ] }" instead of rejecting
