[Killed] ArrowFunction
src/adapters/config-loader.ts:342:58
   const groups = groupEntriesByDatasetKey(entries)
 
   for (const [, { datasetKey, ops }] of groups) {
-    const groupEntries = ops.flatMap(o => o.indices).map(i => entries[i])
+    const groupEntries = ops.flatMap(o => o.indices).map(() => undefined)
     if (groupEntries.length < 2) continue
 
killedBy: ConfigLoader operation consistency given entries with same operation on same dataset, when loading, then succeeds
statusReason: Cannot read properties of undefined (reading 'augmentColumns')

[Killed] EqualityOperator
src/adapters/config-loader.ts:343:9
 
   for (const [, { datasetKey, ops }] of groups) {
     const groupEntries = ops.flatMap(o => o.indices).map(i => entries[i])
-    if (groupEntries.length < 2) continue
+    if (groupEntries.length <= 2) continue
 
     const firstKeys = Object.keys(groupEntries[0].augmentColumns ?? {})
killedBy: ConfigLoader augment consistency given two entries sharing DatasetKey with different augment column names, when parsing, then throws
statusReason: promise resolved "{ entries: [ { …(7) }, { …(7) } ] }" instead of rejecting

[Killed] EqualityOperator
src/adapters/config-loader.ts:343:9
 
   for (const [, { datasetKey, ops }] of groups) {
     const groupEntries = ops.flatMap(o => o.indices).map(i => entries[i])
-    if (groupEntries.length < 2) continue
+    if (groupEntries.length >= 2) continue
 
     const firstKeys = Object.keys(groupEntries[0].augmentColumns ?? {})
killedBy: ConfigLoader augment consistency given two entries sharing DatasetKey with different augment column names, when parsing, then throws
statusReason: promise resolved "{ entries: [ { …(7) }, { …(7) } ] }" instead of rejecting

[Killed] LogicalOperator
src/adapters/config-loader.ts:345:35
     const groupEntries = ops.flatMap(o => o.indices).map(i => entries[i])
     if (groupEntries.length < 2) continue
 
-    const firstKeys = Object.keys(groupEntries[0].augmentColumns ?? {})
+    const firstKeys = Object.keys(groupEntries[0].augmentColumns && {})
       .sort()
       .join(',')
killedBy: ConfigLoader operation consistency given entries with same operation on same dataset, when loading, then succeeds
statusReason: Cannot convert undefined or null to object

[Killed] MethodExpression
src/adapters/config-loader.ts:345:23
     const groupEntries = ops.flatMap(o => o.indices).map(i => entries[i])
     if (groupEntries.length < 2) continue
 
-    const firstKeys = Object.keys(groupEntries[0].augmentColumns ?? {})
-      .sort()
+    const firstKeys = Object.keys(groupEntries[0].augmentColumns ?? {})
       .join(',')
     for (const entry of groupEntries.slice(1)) {
killedBy: ConfigLoader augmentColumn key sort consistency given two entries with same augment keys in different insertion order, when parsing, then succeeds
statusReason: Entries targeting 'org:ana:DS' have different augment column names: [B,A] vs [A,B]

[Killed] BlockStatement
src/adapters/config-loader.ts:348:48
     const firstKeys = Object.keys(groupEntries[0].augmentColumns ?? {})
       .sort()
       .join(',')
-    for (const entry of groupEntries.slice(1)) {
-      const keys = Object.keys(entry.augmentColumns ?? {})
-        .sort()
-        .join(',')
-      if (firstKeys !== keys) {
-        throw new Error(
-          `Entries targeting '${datasetKey.toString()}' have different augment column names: [${firstKeys}] vs [${keys}]`
-        )
-      }
-    }
+    for (const entry of groupEntries.slice(1)) {}
   }
 }
killedBy: ConfigLoader augment consistency given two entries sharing DatasetKey with different augment column names, when parsing, then throws
statusReason: promise resolved "{ entries: [ { …(7) }, { …(7) } ] }" instead of rejecting

[Survived] MethodExpression
src/adapters/config-loader.ts:348:25
     const firstKeys = Object.keys(groupEntries[0].augmentColumns ?? {})
       .sort()
       .join(',')
-    for (const entry of groupEntries.slice(1)) {
+    for (const entry of groupEntries) {
       const keys = Object.keys(entry.augmentColumns ?? {})
         .sort()

[Killed] MethodExpression
src/adapters/config-loader.ts:349:20
       .sort()
       .join(',')
     for (const entry of groupEntries.slice(1)) {
-      const keys = Object.keys(entry.augmentColumns ?? {})
-        .sort()
+      const keys = Object.keys(entry.augmentColumns ?? {})
         .join(',')
       if (firstKeys !== keys) {
killedBy: ConfigLoader augmentColumn key sort consistency given two entries with same augment keys in different insertion order, when parsing, then succeeds
statusReason: Entries targeting 'org:ana:DS' have different augment column names: [A,B] vs [B,A]

[Killed] LogicalOperator
src/adapters/config-loader.ts:349:32
       .sort()
       .join(',')
     for (const entry of groupEntries.slice(1)) {
-      const keys = Object.keys(entry.augmentColumns ?? {})
+      const keys = Object.keys(entry.augmentColumns && {})
         .sort()
         .join(',')
killedBy: ConfigLoader operation consistency given entries with same operation on same dataset, when loading, then succeeds
statusReason: Cannot convert undefined or null to object

[Killed] StringLiteral
src/adapters/config-loader.ts:351:15
     for (const entry of groupEntries.slice(1)) {
       const keys = Object.keys(entry.augmentColumns ?? {})
         .sort()
-        .join(',')
+        .join("")
       if (firstKeys !== keys) {
         throw new Error(
killedBy: ConfigLoader augmentColumn key sort consistency given two entries with same augment keys in different insertion order, when parsing, then succeeds
statusReason: Entries targeting 'org:ana:DS' have different augment column names: [A,B] vs [AB]

[Killed] ConditionalExpression
src/adapters/config-loader.ts:352:11
       const keys = Object.keys(entry.augmentColumns ?? {})
         .sort()
         .join(',')
-      if (firstKeys !== keys) {
+      if (true) {
         throw new Error(
           `Entries targeting '${datasetKey.toString()}' have different augment column names: [${firstKeys}] vs [${keys}]`
killedBy: ConfigLoader operation consistency given entries with same operation on same dataset, when loading, then succeeds
statusReason: Entries targeting 'org:ana:DS' have different augment column names: [] vs []

[Killed] BlockStatement
src/adapters/config-loader.ts:352:31
       const keys = Object.keys(entry.augmentColumns ?? {})
         .sort()
         .join(',')
-      if (firstKeys !== keys) {
-        throw new Error(
-          `Entries targeting '${datasetKey.toString()}' have different augment column names: [${firstKeys}] vs [${keys}]`
-        )
-      }
+      if (firstKeys !== keys) {}
     }
   }
killedBy: ConfigLoader augment consistency given two entries sharing DatasetKey with different augment column names, when parsing, then throws
statusReason: promise resolved "{ entries: [ { …(7) }, { …(7) } ] }" instead of rejecting

[Killed] BlockStatement
src/adapters/config-loader.ts:361:72
   }
 }
 
-function validateSObjectFieldConsistency(entries: ConfigEntry[]): void {
-  const groups = groupEntriesByDatasetKey(entries)
-
-  for (const [, { datasetKey, ops }] of groups) {
-    const sobjectEntries = ops
-      .flatMap(o => o.indices)
-      .map(i => entries[i])
-      .filter((e): e is SObjectEntry => isSObjectEntry(e))
-    if (sobjectEntries.length < 2) continue
-
-    const firstFields = [...sobjectEntries[0].fields].sort()
-    for (const entry of sobjectEntries.slice(1)) {
-      const fields = [...entry.fields].sort()
-      if (firstFields.join(',') !== fields.join(',')) {
-        throw new Error(
-          `SObject entries targeting '${datasetKey.toString()}' have different fields: [${firstFields}] vs [${fields}]`
-        )
-      }
-    }
-  }
-}
+function validateSObjectFieldConsistency(entries: ConfigEntry[]): void {}
 
 function resolveAugmentColumnsForEntry(
killedBy: ConfigLoader augment consistency given two sobject entries sharing DatasetKey with different fields, when parsing, then throws
statusReason: promise resolved "{ entries: [ { …(7) }, { …(7) } ] }" instead of rejecting

[Killed] BlockStatement
src/adapters/config-loader.ts:364:49
 function validateSObjectFieldConsistency(entries: ConfigEntry[]): void {
   const groups = groupEntriesByDatasetKey(entries)
 
-  for (const [, { datasetKey, ops }] of groups) {
-    const sobjectEntries = ops
-      .flatMap(o => o.indices)
-      .map(i => entries[i])
-      .filter((e): e is SObjectEntry => isSObjectEntry(e))
-    if (sobjectEntries.length < 2) continue
-
-    const firstFields = [...sobjectEntries[0].fields].sort()
-    for (const entry of sobjectEntries.slice(1)) {
-      const fields = [...entry.fields].sort()
-      if (firstFields.join(',') !== fields.join(',')) {
-        throw new Error(
-          `SObject entries targeting '${datasetKey.toString()}' have different fields: [${firstFields}] vs [${fields}]`
-        )
-      }
-    }
-  }
+  for (const [, { datasetKey, ops }] of groups) {}
 }
 
killedBy: ConfigLoader augment consistency given two sobject entries sharing DatasetKey with different fields, when parsing, then throws
statusReason: promise resolved "{ entries: [ { …(7) }, { …(7) } ] }" instead of rejecting

[Killed] MethodExpression
src/adapters/config-loader.ts:365:28
   const groups = groupEntriesByDatasetKey(entries)
 
   for (const [, { datasetKey, ops }] of groups) {
-    const sobjectEntries = ops
-      .flatMap(o => o.indices)
-      .map(i => entries[i])
-      .filter((e): e is SObjectEntry => isSObjectEntry(e))
+    const sobjectEntries = ops.flatMap(o => o.indices).map(i => entries[i])
     if (sobjectEntries.length < 2) continue
 
killedBy: ConfigLoader operation consistency given entries with same operation on same dataset, when loading, then succeeds
statusReason: sobjectEntries[0].fields is not iterable

[Killed] ArrowFunction
src/adapters/config-loader.ts:366:16
 
   for (const [, { datasetKey, ops }] of groups) {
     const sobjectEntries = ops
-      .flatMap(o => o.indices)
+      .flatMap(() => undefined)
       .map(i => entries[i])
       .filter((e): e is SObjectEntry => isSObjectEntry(e))
killedBy: ConfigLoader schema validation given valid ELF config, when loading, then returns resolved entries
statusReason: Cannot use 'in' operator to search for 'sObject' in undefined

[Killed] ArrowFunction
src/adapters/config-loader.ts:367:12
   for (const [, { datasetKey, ops }] of groups) {
     const sobjectEntries = ops
       .flatMap(o => o.indices)
-      .map(i => entries[i])
+      .map(() => undefined)
       .filter((e): e is SObjectEntry => isSObjectEntry(e))
     if (sobjectEntries.length < 2) continue
killedBy: ConfigLoader schema validation given valid ELF config, when loading, then returns resolved entries
statusReason: Cannot use 'in' operator to search for 'sObject' in undefined

[Killed] ArrowFunction
src/adapters/config-loader.ts:368:15
     const sobjectEntries = ops
       .flatMap(o => o.indices)
       .map(i => entries[i])
-      .filter((e): e is SObjectEntry => isSObjectEntry(e))
+      .filter(() => undefined)
     if (sobjectEntries.length < 2) continue
 
killedBy: ConfigLoader augment consistency given two sobject entries sharing DatasetKey with different fields, when parsing, then throws
statusReason: promise resolved "{ entries: [ { …(7) }, { …(7) } ] }" instead of rejecting

[Killed] ConditionalExpression
src/adapters/config-loader.ts:369:9
       .flatMap(o => o.indices)
       .map(i => entries[i])
       .filter((e): e is SObjectEntry => isSObjectEntry(e))
-    if (sobjectEntries.length < 2) continue
+    if (false) continue
 
     const firstFields = [...sobjectEntries[0].fields].sort()
killedBy: ConfigLoader schema validation given valid ELF config, when loading, then returns resolved entries
statusReason: Cannot read properties of undefined (reading 'fields')

[Killed] ConditionalExpression
src/adapters/config-loader.ts:369:9
       .flatMap(o => o.indices)
       .map(i => entries[i])
       .filter((e): e is SObjectEntry => isSObjectEntry(e))
-    if (sobjectEntries.length < 2) continue
+    if (true) continue
 
     const firstFields = [...sobjectEntries[0].fields].sort()
killedBy: ConfigLoader augment consistency given two sobject entries sharing DatasetKey with different fields, when parsing, then throws
statusReason: promise resolved "{ entries: [ { …(7) }, { …(7) } ] }" instead of rejecting

[Killed] MethodExpression
src/adapters/config-loader.ts:371:25
       .filter((e): e is SObjectEntry => isSObjectEntry(e))
     if (sobjectEntries.length < 2) continue
 
-    const firstFields = [...sobjectEntries[0].fields].sort()
+    const firstFields = [...sobjectEntries[0].fields]
     for (const entry of sobjectEntries.slice(1)) {
       const fields = [...entry.fields].sort()
killedBy: ConfigLoader sobject field sort consistency given two sobject entries with same fields in different order, when parsing, then succeeds
statusReason: SObject entries targeting 'org:ana:DS' have different fields: [Name,Id] vs [Id,Name]

[Killed] BlockStatement
src/adapters/config-loader.ts:372:50
     if (sobjectEntries.length < 2) continue
 
     const firstFields = [...sobjectEntries[0].fields].sort()
-    for (const entry of sobjectEntries.slice(1)) {
-      const fields = [...entry.fields].sort()
-      if (firstFields.join(',') !== fields.join(',')) {
-        throw new Error(
-          `SObject entries targeting '${datasetKey.toString()}' have different fields: [${firstFields}] vs [${fields}]`
-        )
-      }
-    }
+    for (const entry of sobjectEntries.slice(1)) {}
   }
 }
killedBy: ConfigLoader augment consistency given two sobject entries sharing DatasetKey with different fields, when parsing, then throws
statusReason: promise resolved "{ entries: [ { …(7) }, { …(7) } ] }" instead of rejecting

[Survived] MethodExpression
src/adapters/config-loader.ts:372:25
     if (sobjectEntries.length < 2) continue
 
     const firstFields = [...sobjectEntries[0].fields].sort()
-    for (const entry of sobjectEntries.slice(1)) {
+    for (const entry of sobjectEntries) {
       const fields = [...entry.fields].sort()
       if (firstFields.join(',') !== fields.join(',')) {

[Killed] MethodExpression
src/adapters/config-loader.ts:373:22
 
     const firstFields = [...sobjectEntries[0].fields].sort()
     for (const entry of sobjectEntries.slice(1)) {
-      const fields = [...entry.fields].sort()
+      const fields = [...entry.fields]
       if (firstFields.join(',') !== fields.join(',')) {
         throw new Error(
killedBy: ConfigLoader sobject field sort consistency given two sobject entries with same fields in different order, when parsing, then succeeds
statusReason: SObject entries targeting 'org:ana:DS' have different fields: [Id,Name] vs [Name,Id]

[Killed] ArrayDeclaration
src/adapters/config-loader.ts:373:22
 
     const firstFields = [...sobjectEntries[0].fields].sort()
     for (const entry of sobjectEntries.slice(1)) {
-      const fields = [...entry.fields].sort()
+      const fields = [].sort()
       if (firstFields.join(',') !== fields.join(',')) {
         throw new Error(
killedBy: ConfigLoader augment consistency given two sobject entries sharing DatasetKey with same fields, when parsing, then succeeds
statusReason: SObject entries targeting 'org:ana:DS' have different fields: [Id,Name] vs []

[Killed] ConditionalExpression
src/adapters/config-loader.ts:374:11
     const firstFields = [...sobjectEntries[0].fields].sort()
     for (const entry of sobjectEntries.slice(1)) {
       const fields = [...entry.fields].sort()
-      if (firstFields.join(',') !== fields.join(',')) {
+      if (true) {
         throw new Error(
           `SObject entries targeting '${datasetKey.toString()}' have different fields: [${firstFields}] vs [${fields}]`
killedBy: ConfigLoader augment consistency given two sobject entries sharing DatasetKey with same fields, when parsing, then succeeds
statusReason: SObject entries targeting 'org:ana:DS' have different fields: [Id,Name] vs [Id,Name]

[Killed] BlockStatement
src/adapters/config-loader.ts:374:55
     const firstFields = [...sobjectEntries[0].fields].sort()
     for (const entry of sobjectEntries.slice(1)) {
       const fields = [...entry.fields].sort()
-      if (firstFields.join(',') !== fields.join(',')) {
-        throw new Error(
-          `SObject entries targeting '${datasetKey.toString()}' have different fields: [${firstFields}] vs [${fields}]`
-        )
-      }
+      if (firstFields.join(',') !== fields.join(',')) {}
     }
   }
killedBy: ConfigLoader augment consistency given two sobject entries sharing DatasetKey with different fields, when parsing, then throws
statusReason: promise resolved "{ entries: [ { …(7) }, { …(7) } ] }" instead of rejecting

[Killed] BlockStatement
src/adapters/config-loader.ts:387:27
   columns: Record<string, string> | undefined,
   entry: ElfEntry | SObjectEntry,
   orgInfos: Map<string, OrgInfo>
-): Record<string, string> {
-  if (!columns) return {}
-  const resolved: Record<string, string> = {}
-
-  const getOrgInfo = (alias: string): OrgInfo => {
-    const info = orgInfos.get(alias)
-    /* v8 ignore next -- orgInfos is built from the same entries; missing alias is a programming error */
-    if (!info) throw new Error(`Org info not resolved for '${alias}'`)
-    return info
-  }
-
-  for (const [key, value] of Object.entries(columns)) {
-    resolved[key] = value.replace(MUSTACHE_TOKEN, (_, token: string) => {
-      if (token === 'sourceOrg.Id') return getOrgInfo(entry.sourceOrg).Id
-      if (token === 'sourceOrg.Name') return getOrgInfo(entry.sourceOrg).Name
-      if (token === 'targetOrg.Id') return getOrgInfo(entry.targetOrg!).Id
-      if (token === 'targetOrg.Name') return getOrgInfo(entry.targetOrg!).Name
-      throw new Error(`Unknown mustache token: {{${token}}}`)
-    })
-  }
-  return resolved
-}
+): Record<string, string> {}
 
 export async function parseConfig(configPath: string): Promise<Config> {
killedBy: ConfigLoader augment column resolution given {{sourceOrg.Id}} mustache token, when loading, then resolves to source org id
statusReason: expected undefined to deeply equal { OrgId: '00Dsrc' }

[Killed] BooleanLiteral
src/adapters/config-loader.ts:388:7
   entry: ElfEntry | SObjectEntry,
   orgInfos: Map<string, OrgInfo>
 ): Record<string, string> {
-  if (!columns) return {}
+  if (columns) return {}
   const resolved: Record<string, string> = {}
 
killedBy: ConfigLoader schema validation given valid ELF config, when loading, then returns resolved entries
statusReason: Cannot convert undefined or null to object

[Killed] ConditionalExpression
src/adapters/config-loader.ts:388:7
   entry: ElfEntry | SObjectEntry,
   orgInfos: Map<string, OrgInfo>
 ): Record<string, string> {
-  if (!columns) return {}
+  if (false) return {}
   const resolved: Record<string, string> = {}
 
killedBy: ConfigLoader schema validation given valid ELF config, when loading, then returns resolved entries
statusReason: Cannot convert undefined or null to object

[Killed] BlockStatement
src/adapters/config-loader.ts:391:50
   if (!columns) return {}
   const resolved: Record<string, string> = {}
 
-  const getOrgInfo = (alias: string): OrgInfo => {
-    const info = orgInfos.get(alias)
-    /* v8 ignore next -- orgInfos is built from the same entries; missing alias is a programming error */
-    if (!info) throw new Error(`Org info not resolved for '${alias}'`)
-    return info
-  }
+  const getOrgInfo = (alias: string): OrgInfo => {}
 
   for (const [key, value] of Object.entries(columns)) {
killedBy: ConfigLoader augment column resolution given {{sourceOrg.Id}} mustache token, when loading, then resolves to source org id
statusReason: Cannot read properties of undefined (reading 'Id')

[Killed] ConditionalExpression
src/adapters/config-loader.ts:394:9
   const getOrgInfo = (alias: string): OrgInfo => {
     const info = orgInfos.get(alias)
     /* v8 ignore next -- orgInfos is built from the same entries; missing alias is a programming error */
-    if (!info) throw new Error(`Org info not resolved for '${alias}'`)
+    if (true) throw new Error(`Org info not resolved for '${alias}'`)
     return info
   }
killedBy: ConfigLoader augment column resolution given {{sourceOrg.Id}} mustache token, when loading, then resolves to source org id
statusReason: Org info not resolved for 'source'

[Killed] BooleanLiteral
src/adapters/config-loader.ts:394:9
   const getOrgInfo = (alias: string): OrgInfo => {
     const info = orgInfos.get(alias)
     /* v8 ignore next -- orgInfos is built from the same entries; missing alias is a programming error */
-    if (!info) throw new Error(`Org info not resolved for '${alias}'`)
+    if (info) throw new Error(`Org info not resolved for '${alias}'`)
     return info
   }
killedBy: ConfigLoader augment column resolution given {{sourceOrg.Id}} mustache token, when loading, then resolves to source org id
statusReason: Org info not resolved for 'source'

[Killed] BlockStatement
src/adapters/config-loader.ts:398:55
     return info
   }
 
-  for (const [key, value] of Object.entries(columns)) {
-    resolved[key] = value.replace(MUSTACHE_TOKEN, (_, token: string) => {
-      if (token === 'sourceOrg.Id') return getOrgInfo(entry.sourceOrg).Id
-      if (token === 'sourceOrg.Name') return getOrgInfo(entry.sourceOrg).Name
-      if (token === 'targetOrg.Id') return getOrgInfo(entry.targetOrg!).Id
-      if (token === 'targetOrg.Name') return getOrgInfo(entry.targetOrg!).Name
-      throw new Error(`Unknown mustache token: {{${token}}}`)
-    })
-  }
+  for (const [key, value] of Object.entries(columns)) {}
   return resolved
 }
killedBy: ConfigLoader augment column resolution given {{sourceOrg.Id}} mustache token, when loading, then resolves to source org id
statusReason: expected {} to deeply equal { OrgId: '00Dsrc' }

[Killed] BlockStatement
src/adapters/config-loader.ts:399:73
   }
 
   for (const [key, value] of Object.entries(columns)) {
-    resolved[key] = value.replace(MUSTACHE_TOKEN, (_, token: string) => {
-      if (token === 'sourceOrg.Id') return getOrgInfo(entry.sourceOrg).Id
-      if (token === 'sourceOrg.Name') return getOrgInfo(entry.sourceOrg).Name
-      if (token === 'targetOrg.Id') return getOrgInfo(entry.targetOrg!).Id
-      if (token === 'targetOrg.Name') return getOrgInfo(entry.targetOrg!).Name
-      throw new Error(`Unknown mustache token: {{${token}}}`)
-    })
+    resolved[key] = value.replace(MUSTACHE_TOKEN, (_, token: string) => {})
   }
   return resolved
killedBy: ConfigLoader augment column resolution given {{sourceOrg.Id}} mustache token, when loading, then resolves to source org id
statusReason: expected { OrgId: 'undefined' } to deeply equal { OrgId: '00Dsrc' }

[Killed] ConditionalExpression
src/adapters/config-loader.ts:400:11
 
   for (const [key, value] of Object.entries(columns)) {
     resolved[key] = value.replace(MUSTACHE_TOKEN, (_, token: string) => {
-      if (token === 'sourceOrg.Id') return getOrgInfo(entry.sourceOrg).Id
+      if (false) return getOrgInfo(entry.sourceOrg).Id
       if (token === 'sourceOrg.Name') return getOrgInfo(entry.sourceOrg).Name
       if (token === 'targetOrg.Id') return getOrgInfo(entry.targetOrg!).Id
killedBy: ConfigLoader augment column resolution given {{sourceOrg.Id}} mustache token, when loading, then resolves to source org id
statusReason: Unknown mustache token: {{sourceOrg.Id}}

[Killed] ConditionalExpression
src/adapters/config-loader.ts:400:11
 
   for (const [key, value] of Object.entries(columns)) {
     resolved[key] = value.replace(MUSTACHE_TOKEN, (_, token: string) => {
-      if (token === 'sourceOrg.Id') return getOrgInfo(entry.sourceOrg).Id
+      if (true) return getOrgInfo(entry.sourceOrg).Id
       if (token === 'sourceOrg.Name') return getOrgInfo(entry.sourceOrg).Name
       if (token === 'targetOrg.Id') return getOrgInfo(entry.targetOrg!).Id
killedBy: ConfigLoader augment column resolution given mixed static and {{sourceOrg.Name}} in value, when loading, then interpolates
statusReason: expected { Label: 'PROD-00Dsrc' } to deeply equal { Label: 'PROD-MyOrg' }

[Killed] ConditionalExpression
src/adapters/config-loader.ts:401:11
   for (const [key, value] of Object.entries(columns)) {
     resolved[key] = value.replace(MUSTACHE_TOKEN, (_, token: string) => {
       if (token === 'sourceOrg.Id') return getOrgInfo(entry.sourceOrg).Id
-      if (token === 'sourceOrg.Name') return getOrgInfo(entry.sourceOrg).Name
+      if (true) return getOrgInfo(entry.sourceOrg).Name
       if (token === 'targetOrg.Id') return getOrgInfo(entry.targetOrg!).Id
       if (token === 'targetOrg.Name') return getOrgInfo(entry.targetOrg!).Name
killedBy: ConfigLoader augment column resolution given multiple mustache tokens in same value, when loading, then resolves all
statusReason: expected { Label: 'MyOrg-MyOrg' } to deeply equal { Label: 'MyOrg-00Dana' }

[Killed] EqualityOperator
src/adapters/config-loader.ts:401:11
   for (const [key, value] of Object.entries(columns)) {
     resolved[key] = value.replace(MUSTACHE_TOKEN, (_, token: string) => {
       if (token === 'sourceOrg.Id') return getOrgInfo(entry.sourceOrg).Id
-      if (token === 'sourceOrg.Name') return getOrgInfo(entry.sourceOrg).Name
+      if (token !== 'sourceOrg.Name') return getOrgInfo(entry.sourceOrg).Name
       if (token === 'targetOrg.Id') return getOrgInfo(entry.targetOrg!).Id
       if (token === 'targetOrg.Name') return getOrgInfo(entry.targetOrg!).Name
killedBy: ConfigLoader augment column resolution given mixed static and {{sourceOrg.Name}} in value, when loading, then interpolates
statusReason: Unknown mustache token: {{sourceOrg.Name}}

[Killed] ConditionalExpression
src/adapters/config-loader.ts:402:11
     resolved[key] = value.replace(MUSTACHE_TOKEN, (_, token: string) => {
       if (token === 'sourceOrg.Id') return getOrgInfo(entry.sourceOrg).Id
       if (token === 'sourceOrg.Name') return getOrgInfo(entry.sourceOrg).Name
-      if (token === 'targetOrg.Id') return getOrgInfo(entry.targetOrg!).Id
+      if (true) return getOrgInfo(entry.targetOrg!).Id
       if (token === 'targetOrg.Name') return getOrgInfo(entry.targetOrg!).Name
       throw new Error(`Unknown mustache token: {{${token}}}`)
killedBy: ConfigLoader augment column resolution given unknown mustache token, when loading, then throws
statusReason: expected [Function] to throw error matching /unknownVar/ but got 'Org info not resolved for \'analytic\''

[Killed] EqualityOperator
src/adapters/config-loader.ts:402:11
     resolved[key] = value.replace(MUSTACHE_TOKEN, (_, token: string) => {
       if (token === 'sourceOrg.Id') return getOrgInfo(entry.sourceOrg).Id
       if (token === 'sourceOrg.Name') return getOrgInfo(entry.sourceOrg).Name
-      if (token === 'targetOrg.Id') return getOrgInfo(entry.targetOrg!).Id
+      if (token !== 'targetOrg.Id') return getOrgInfo(entry.targetOrg!).Id
       if (token === 'targetOrg.Name') return getOrgInfo(entry.targetOrg!).Name
       throw new Error(`Unknown mustache token: {{${token}}}`)
killedBy: ConfigLoader augment column resolution given multiple mustache tokens in same value, when loading, then resolves all
statusReason: Unknown mustache token: {{targetOrg.Id}}

[Killed] ConditionalExpression
src/adapters/config-loader.ts:403:11
       if (token === 'sourceOrg.Id') return getOrgInfo(entry.sourceOrg).Id
       if (token === 'sourceOrg.Name') return getOrgInfo(entry.sourceOrg).Name
       if (token === 'targetOrg.Id') return getOrgInfo(entry.targetOrg!).Id
-      if (token === 'targetOrg.Name') return getOrgInfo(entry.targetOrg!).Name
+      if (false) return getOrgInfo(entry.targetOrg!).Name
       throw new Error(`Unknown mustache token: {{${token}}}`)
     })
killedBy: ConfigLoader augment column resolution given targetOrg Name expression, when loading, then resolves to target org name
statusReason: Unknown mustache token: {{targetOrg.Name}}

[Killed] ConditionalExpression
src/adapters/config-loader.ts:403:11
       if (token === 'sourceOrg.Id') return getOrgInfo(entry.sourceOrg).Id
       if (token === 'sourceOrg.Name') return getOrgInfo(entry.sourceOrg).Name
       if (token === 'targetOrg.Id') return getOrgInfo(entry.targetOrg!).Id
-      if (token === 'targetOrg.Name') return getOrgInfo(entry.targetOrg!).Name
+      if (true) return getOrgInfo(entry.targetOrg!).Name
       throw new Error(`Unknown mustache token: {{${token}}}`)
     })
killedBy: ConfigLoader augment column resolution given unknown mustache token, when loading, then throws
statusReason: expected [Function] to throw error matching /unknownVar/ but got 'Org info not resolved for \'analytic\''

[Killed] BlockStatement
src/adapters/config-loader.ts:410:72
   return resolved
 }
 
-export async function parseConfig(configPath: string): Promise<Config> {
-  const raw = await readFile(configPath, 'utf-8')
-  const config: Config = configSchema.parse(JSON.parse(raw))
-  validateOperationConsistency(config.entries)
-  validateNameUniqueness(config.entries)
-  validateAugmentColumnConsistency(config.entries)
-  validateSObjectFieldConsistency(config.entries)
-  return config
-}
+export async function parseConfig(configPath: string): Promise<Config> {}
 
 export async function resolveConfig(
killedBy: ConfigLoader schema validation given valid ELF config, when loading, then returns resolved entries
statusReason: Cannot read properties of undefined (reading 'entries')

[Survived] StringLiteral
src/adapters/config-loader.ts:411:42
 }
 
 export async function parseConfig(configPath: string): Promise<Config> {
-  const raw = await readFile(configPath, 'utf-8')
+  const raw = await readFile(configPath, "")
   const config: Config = configSchema.parse(JSON.parse(raw))
   validateOperationConsistency(config.entries)
