[Killed] BlockStatement
src/adapters/config-loader.ts:428:43
   const orgInfos = new Map<string, OrgInfo>()
 
   await Promise.all(
-    [...orgsToResolve].map(async alias => {
-      const sfPort = sfPorts.get(alias)
-      if (!sfPort)
-        throw new Error(`No authenticated connection for org '${alias}'`)
-      const result = await sfPort.query<OrgInfo>(
-        'SELECT Id, Name FROM Organization LIMIT 1'
-      )
-      if (result.records.length === 0)
-        throw new Error(`Organization query returned no records for '${alias}'`)
-      orgInfos.set(alias, result.records[0])
-    })
+    [...orgsToResolve].map(async alias => {})
   )
 
killedBy: ConfigLoader augment column resolution given {{sourceOrg.Id}} mustache token, when loading, then resolves to source org id
statusReason: Org info not resolved for 'source'

[Killed] ArrayDeclaration
src/adapters/config-loader.ts:428:5
   const orgInfos = new Map<string, OrgInfo>()
 
   await Promise.all(
-    [...orgsToResolve].map(async alias => {
+    [].map(async alias => {
       const sfPort = sfPorts.get(alias)
       if (!sfPort)
killedBy: ConfigLoader augment column resolution given {{sourceOrg.Id}} mustache token, when loading, then resolves to source org id
statusReason: Org info not resolved for 'source'

[Killed] ConditionalExpression
src/adapters/config-loader.ts:430:11
   await Promise.all(
     [...orgsToResolve].map(async alias => {
       const sfPort = sfPorts.get(alias)
-      if (!sfPort)
+      if (true)
         throw new Error(`No authenticated connection for org '${alias}'`)
       const result = await sfPort.query<OrgInfo>(
killedBy: ConfigLoader augment column resolution given {{sourceOrg.Id}} mustache token, when loading, then resolves to source org id
statusReason: No authenticated connection for org 'source'

[Killed] ConditionalExpression
src/adapters/config-loader.ts:430:11
   await Promise.all(
     [...orgsToResolve].map(async alias => {
       const sfPort = sfPorts.get(alias)
-      if (!sfPort)
+      if (false)
         throw new Error(`No authenticated connection for org '${alias}'`)
       const result = await sfPort.query<OrgInfo>(
killedBy: ConfigLoader augment column resolution given dynamic expression but missing client, when loading, then throws error
statusReason: expected [Function] to throw error matching /No authenticated connection/ but got 'Cannot read properties of undefined (…'

[Killed] StringLiteral
src/adapters/config-loader.ts:431:25
     [...orgsToResolve].map(async alias => {
       const sfPort = sfPorts.get(alias)
       if (!sfPort)
-        throw new Error(`No authenticated connection for org '${alias}'`)
+        throw new Error(``)
       const result = await sfPort.query<OrgInfo>(
         'SELECT Id, Name FROM Organization LIMIT 1'
killedBy: ConfigLoader augment column resolution given dynamic expression but missing client, when loading, then throws error
statusReason: expected [Function] to throw error matching /No authenticated connection/ but got ''

[Killed] EqualityOperator
src/adapters/config-loader.ts:435:11
       const result = await sfPort.query<OrgInfo>(
         'SELECT Id, Name FROM Organization LIMIT 1'
       )
-      if (result.records.length === 0)
+      if (result.records.length !== 0)
         throw new Error(`Organization query returned no records for '${alias}'`)
       orgInfos.set(alias, result.records[0])
killedBy: ConfigLoader augment column resolution given {{sourceOrg.Id}} mustache token, when loading, then resolves to source org id
statusReason: Organization query returned no records for 'source'

[Killed] ConditionalExpression
src/adapters/config-loader.ts:435:11
       const result = await sfPort.query<OrgInfo>(
         'SELECT Id, Name FROM Organization LIMIT 1'
       )
-      if (result.records.length === 0)
+      if (false)
         throw new Error(`Organization query returned no records for '${alias}'`)
       orgInfos.set(alias, result.records[0])
killedBy: ConfigLoader augment column resolution given org query returns no records, when loading, then throws error
statusReason: expected [Function] to throw error matching /Organization query returned no records/ but got 'Org info not resolved for \'source\''

[Killed] ArrowFunction
src/adapters/config-loader.ts:441:29
     })
   )
 
-  return config.entries.map((entry, index) => ({
-    entry,
-    index,
-    augmentColumns: isCsvEntry(entry)
-      ? (entry.augmentColumns ?? {})
-      : resolveAugmentColumnsForEntry(entry.augmentColumns, entry, orgInfos),
-  }))
+  return config.entries.map(() => undefined)
 }
 
killedBy: ConfigLoader schema validation given valid ELF config, when loading, then returns resolved entries
statusReason: Cannot read properties of undefined (reading 'entry')

[Killed] LogicalOperator
src/adapters/config-loader.ts:445:10
     entry,
     index,
     augmentColumns: isCsvEntry(entry)
-      ? (entry.augmentColumns ?? {})
+      ? (entry.augmentColumns && {})
       : resolveAugmentColumnsForEntry(entry.augmentColumns, entry, orgInfos),
   }))
killedBy: ConfigLoader augment column resolution given CSV entry alongside ELF entry with mustache, when loading, then resolves only ELF augment columns
statusReason: expected {} to deeply equal { Tag: 'manual' }

[Killed] BlockStatement
src/adapters/config-loader.ts:450:56
   }))
 }
 
-export function entryLabel(entry: ConfigEntry): string {
-  if (entry.name) return entry.name
-  if (isElfEntry(entry)) return `elf:${entry.eventLog}`
-  if (isSObjectEntry(entry)) return `sobject:${entry.sObject}`
-  if (isCsvEntry(entry)) return `csv:${entry.csvFile}`
-  throw new Error(`Unknown entry shape`)
-}
+export function entryLabel(entry: ConfigEntry): string {}
 
killedBy: ConfigLoader entryLabel given CSV entry without name, when getting label, then returns csv-prefixed csvFile
statusReason: expected undefined to be 'csv:./data/login.csv' // Object.is equality

[Killed] ConditionalExpression
src/adapters/config-loader.ts:451:7
 }
 
 export function entryLabel(entry: ConfigEntry): string {
-  if (entry.name) return entry.name
+  if (false) return entry.name
   if (isElfEntry(entry)) return `elf:${entry.eventLog}`
   if (isSObjectEntry(entry)) return `sobject:${entry.sObject}`
killedBy: ConfigLoader entryLabel given CSV entry with name, when getting label, then returns name
statusReason: expected 'csv:./data/login.csv' to be 'login-data' // Object.is equality

[Killed] ConditionalExpression
src/adapters/config-loader.ts:451:7
 }
 
 export function entryLabel(entry: ConfigEntry): string {
-  if (entry.name) return entry.name
+  if (true) return entry.name
   if (isElfEntry(entry)) return `elf:${entry.eventLog}`
   if (isSObjectEntry(entry)) return `sobject:${entry.sObject}`
killedBy: ConfigLoader entryLabel given CSV entry without name, when getting label, then returns csv-prefixed csvFile
statusReason: expected undefined to be 'csv:./data/login.csv' // Object.is equality

[Killed] ConditionalExpression
src/adapters/config-loader.ts:452:7
 
 export function entryLabel(entry: ConfigEntry): string {
   if (entry.name) return entry.name
-  if (isElfEntry(entry)) return `elf:${entry.eventLog}`
+  if (false) return `elf:${entry.eventLog}`
   if (isSObjectEntry(entry)) return `sobject:${entry.sObject}`
   if (isCsvEntry(entry)) return `csv:${entry.csvFile}`
killedBy: ConfigLoader entryLabel given ELF entry without name, when getting label, then returns elf-prefixed eventLog
statusReason: Unknown entry shape

[Killed] ConditionalExpression
src/adapters/config-loader.ts:452:7
 
 export function entryLabel(entry: ConfigEntry): string {
   if (entry.name) return entry.name
-  if (isElfEntry(entry)) return `elf:${entry.eventLog}`
+  if (true) return `elf:${entry.eventLog}`
   if (isSObjectEntry(entry)) return `sobject:${entry.sObject}`
   if (isCsvEntry(entry)) return `csv:${entry.csvFile}`
killedBy: ConfigLoader entryLabel given CSV entry without name, when getting label, then returns csv-prefixed csvFile
statusReason: expected 'elf:undefined' to be 'csv:./data/login.csv' // Object.is equality

[Killed] ConditionalExpression
src/adapters/config-loader.ts:453:7
 export function entryLabel(entry: ConfigEntry): string {
   if (entry.name) return entry.name
   if (isElfEntry(entry)) return `elf:${entry.eventLog}`
-  if (isSObjectEntry(entry)) return `sobject:${entry.sObject}`
+  if (false) return `sobject:${entry.sObject}`
   if (isCsvEntry(entry)) return `csv:${entry.csvFile}`
   throw new Error(`Unknown entry shape`)
killedBy: ConfigLoader entryLabel given SObject entry without name, when getting label, then returns sobject-prefixed sObject
statusReason: Unknown entry shape

[Killed] ConditionalExpression
src/adapters/config-loader.ts:453:7
 export function entryLabel(entry: ConfigEntry): string {
   if (entry.name) return entry.name
   if (isElfEntry(entry)) return `elf:${entry.eventLog}`
-  if (isSObjectEntry(entry)) return `sobject:${entry.sObject}`
+  if (true) return `sobject:${entry.sObject}`
   if (isCsvEntry(entry)) return `csv:${entry.csvFile}`
   throw new Error(`Unknown entry shape`)
killedBy: ConfigLoader entryLabel given CSV entry without name, when getting label, then returns csv-prefixed csvFile
statusReason: expected 'sobject:undefined' to be 'csv:./data/login.csv' // Object.is equality

[Killed] ConditionalExpression
src/adapters/config-loader.ts:454:7
   if (entry.name) return entry.name
   if (isElfEntry(entry)) return `elf:${entry.eventLog}`
   if (isSObjectEntry(entry)) return `sobject:${entry.sObject}`
-  if (isCsvEntry(entry)) return `csv:${entry.csvFile}`
+  if (false) return `csv:${entry.csvFile}`
   throw new Error(`Unknown entry shape`)
 }
killedBy: ConfigLoader entryLabel given CSV entry without name, when getting label, then returns csv-prefixed csvFile
statusReason: Unknown entry shape

[Survived] ConditionalExpression
src/adapters/config-loader.ts:454:7
   if (entry.name) return entry.name
   if (isElfEntry(entry)) return `elf:${entry.eventLog}`
   if (isSObjectEntry(entry)) return `sobject:${entry.sObject}`
-  if (isCsvEntry(entry)) return `csv:${entry.csvFile}`
+  if (true) return `csv:${entry.csvFile}`
   throw new Error(`Unknown entry shape`)
 }

[NoCoverage] StringLiteral
src/adapters/config-loader.ts:455:19
   if (isElfEntry(entry)) return `elf:${entry.eventLog}`
   if (isSObjectEntry(entry)) return `sobject:${entry.sObject}`
   if (isCsvEntry(entry)) return `csv:${entry.csvFile}`
-  throw new Error(`Unknown entry shape`)
+  throw new Error(``)
 }
 
